Repository: ehForwarderBot/ehForwarderBot
Catalog: ehforwarderbot/locale/*/LC_MESSAGES/ehforwarderbot.po
Languages: id_id

source: Python 3.6 or higher is required. Your version is {version}.
id_id: Python versi 3.6 atau lebih tinggi diperlukan. Versi Anda adalah {version}.

source: EH Forwarder Bot is an extensible chat tunnel framework which allows users to contact people from other chat platforms, and ultimately remotely control their accounts in other platforms.
id_id: EH Forwarder Bot adalah kerangka terowongan extensible chat yang memungkinkan pengguna untuk menghubungi orang-orang dari platform obrolan lainnya, dan akhirnya remote kontrol akun mereka di platform lainnya.

source: Enable verbose mode. (Level: Debug)
id_id: Mengaktifkan mode verbose. (Tingkat: Debug)

source: Show version numbers and exit.
id_id: Menunjukkan nomor versi dan keluar.

source: Choose a profile to start with.
id_id: Memilih profil untuk memulai dengan.

source: Initializing slave {}...
id_id: {} menginisialisasi budak...

source: Slave channel {name} ({id}) # {instance_id} is initialized.
id_id: Saluran slave {name} ({id}) # {instance_id} diinisialisasi.

source: Default profile
id_id: Profil standar

source: Initializing master {}...
id_id: Menginisialisasi master {}...

source: Master channel {name} ({id}) # {instance_id} is initialized.
id_id: Saluran induk {name} ({id}) # {instance_id} diinisialisasi.

source: All channels initialized.
id_id: Semua saluran yang diinisialisasi.

source: Initializing middleware {}...
id_id: Menginisialisasi middleware {}...

source: All middlewares are initialized.
id_id: Semua middlewares diinisialisasi.

source: EH Forwarder Bot Version: {version} Python version: {py_version}
id_id: EH Forwarder Bot versi: {version} Python versi:{py_version}

source: Master channel:
id_id: Saluran Inti:

source: Slave channel:
id_id: Saluran Slave:

source: Middleware:
id_id: Middlewares:

source: No middleware is enabled.
id_id: Tidak ada middleware yang diaktifkan.
