Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/master.po
Languages: id_id, tr_tr

source: Master channels
id_id: Saluran inti
tr_tr: Ana kanallar

source: Master channels are the interface that directly or indirectly interact with the user. Despite the first master channel of EFB (EFB Telegram Master) is written in a form of Telegram Bot, master channels can be written in many forms, such as:
id_id: Saluran utama adalah antarmuka yang secara langsung atau tidak langsung berinteraksi dengan pengguna. Meskipun saluran inti pertama dari EFB (EFB Telegram Master) ditulis dalam sebuah bentuk Telegram Bot, saluran inti dapat dituliskan dalam banyak bentuk, seperti:
tr_tr: Ana kanallar, kullanıcı ile doğrudan veya dolaylı olarak etkileşim sağlayan arayüzdür. EFB'nin ilk ana kanalı (EFB Telegram Ana kanalı) Telegram Bot biçiminde yazılmasına rağmen, ana kanallar birçok biçimde yazılabilir, örneğin:

source: A web app
id_id: Sebuah aplikasi web
tr_tr: Bir web uyulaması

source: A server that expose APIs to dedicated desktop and mobile clients
tr_tr: API'leri özel masaüstü bilgisayarlara ve mobil istemcilere gösteren bir sunucudur

source: A chat bot on an existing IM
id_id: Sebuah bot obrolan pada sebuah IM yang ada
tr_tr: Mevcut IM'de sohbet botu

source: A server that compiles with a generic IM Protocol
id_id: Server yang mengumpulkan dengan Protokol IM yang umum
tr_tr: Genel bir IM Protokolü ile derlenen sunucu

source: A CLI client
id_id: Sebuah klien CLI
tr_tr: Bir CLI istemcisi

source: Anything else you can think of...
id_id: Ada yang lain yang bisa anda pikirkan...
tr_tr: Aklınıza gelebilecek herşey...

source: Design guideline
id_id: Pedoman desain
tr_tr: Tasarım rehberi

source: When the master channel is implemented on an existing protocol or platform, as far as possible, while considering the user experience, a master channel should:
id_id: Saat saluran induk diimplementasikan pada protokol atau platform yang ada, sejauh mungkin, sambil mempertimbangkan pengalaman pengguna, saluran induk harus:
tr_tr: Ana kanal mevcut bir protokol veya platforma uygulandığı zaman, mümkün olduğu kadar, kullanıcı deneyimini dikkate alırken, ana kanal:

source: support all, if not most, types of messages defined in the framework, process and deliver messages between the user and slave channels;
id_id: mendukung semua, atau paling tidak sebagian besar, jenis pesan yang ditetapkan dalam kerangka kerja, memproses dan menyampaikan pesan antara pengguna dan saluran slave;
tr_tr: Sistemde tanımlanan çoğu türdeki iletileri desteklemek, kullanıcı ve slave kanalları arasında iletileri işlemek ve iletmek;

source: support all, if not most, features of messages, including: targeted message reply, chat substitution in text (usually used in @ references), commands, etc. Master channel should be able to process incoming messages with such features, and send messages with such features to slave channels if applicable;
id_id: mendukung semua, atau paling tidak sebagian besar, fitur pesan, termasuk: balasan pesan tertarget, penggantian obrolan dalam teks (biasanya digunakan dalam @ referensi), perintah, dsb. Saluran induk harus dapat memproses pesan masuk dengan fitur yang demikian, dan mengirim pesan dengan fitur yang demikian ke saluran slave jika berlaku;
tr_tr: hedeflenen mesaj yanıtı, metinde sohbet yerine koyma (genellikle @ referanslarında kullanılır), komutlar vb. de dahil olmak üzere mesajların tüm özelliklerini, hepsi olmasa bile çoğunu destekler. Ana kanal, gelen mesajları bu gibi özelliklerle işleyebilir olmalıdır ve bu gibi özelliklerle bağımlı kanallara eğer uygulanabilirse mesaj gönderebilir;

source: be able to invoke and process "additional features" offered by slave channels.
id_id: dapat memanggil dan memproses "fungsi tambahan" yang ditawarkan oleh saluran slave.
tr_tr: bağımlı kanallar tarafından sunulan "ek özellikler" i çağırıp işleyebilir.

source: Optionally, a master channel can also support / identify vendor-specified information from certain slave channels.
id_id: Selain itu, saluran utama juga dapat mendukung / mengidentifikasi informasi yang disampaikan oleh vendor dari saluran slave tertentu.
tr_tr: İsteğe bağlı olarak, ana kanal, belirli bağımlı kanallardan satıcının belirttiği bilgileri destekleyebilir/tanımlayabilir.

source: An example of an ideal design of a master channel, inspired by Telegram Desktop
id_id: Sebuah contoh desain yang bagus dari saluran utama, terinspirasi oleh Telegram Desktop
tr_tr: Bir ana kanalın ideal tasarımının bir örneği, Telegram Masaüstünden esinlenilmiştir

source: Depends on your implementation, a master channel may probably needs to maintain a list of chats and messages, for presentation or other purposes.
id_id: Bergantung pada apa yang anda terapkan, saluran utama mungkin perlu untuk menyimpan daftar obrolan dan pesan, untuk presentasi atau tujuan lainnya.
tr_tr: Uygulamanıza bağlı olarak, bir ana kanalın sunum veya diğer amaçlar için büyük olasılıkla sohbet ve mesaj listesini koruması gerekebilir.

source: Message delivery
id_id: Pengiriman pesan
tr_tr: Mesaj teslimi

source: Note that sometimes users may send messages outside of this EFB session, so that slave channels might provide a message has its author marked as "self".
id_id: Catatan terkadang bahwa pengguna dapat mengirim pesan ke luar sesi EFB ini, sehingga saluran slave mungkin memberi pesan bahwa pengarangnya ditandai sebagai "diri".
tr_tr: Bazen kullanıcılar, bu EFB oturumunun dışına mesaj gönderebilir, böylece slave kanallarının yazarının "ben" olarak işaretlediği bir mesaj verebileceğini unutmayın.
