Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/media_processing.po
Languages: es_ve, tr_tr, zh_cn

source: Media processing
es_ve: Procesamiento multimedia
tr_tr: Ortam işleme
zh_cn: 媒体处理

source: Choosing media formats
es_ve: Eligiendo formatos multimedia
tr_tr: Ortam formatı seçme
zh_cn: 选择媒体格式

source: Both Master and Slave channel can take their charges to convert media files they send or receive. In general: **if a media file received from remote server is not a common format, convert it before deliver it on; if a media file sent to remote server requires to be in a specific format, it should be converted before sending out**. Nevertheless, this is only a guideline on channels' responsibility regarding media processing, and everyone has their own opinion on what is a common format / encoding. Therefore we only recommend this behaviour, but do not force in our code. This is to say that, you still have to take care of the accepted type of media encoding of your corresponding method of presentation, and convert and/or fallback to different type of representation if necessary. After all, the delivery of information is more important.
es_ve: Los canales maestros y esclavos pueden tomar turnos para convertir los archivos multimedia que envían y reciben. En general: ** Si un archivo proveniente de un servidor remoto no tiene un formato común conviértelo antes de enviarlo; Si un archivo multimedia enviado a un servidor remoto requiere un formato específico, debería ser convertido antes de enviar. Sin embargo, esto son solo lineamientos generales. Sobre las responsabilidades del canal respecto a el procesamiento multimedia todos tienen su propia opinión de cual es el formato/codificación común. Por lo tanto solo recomendamos este comportamiento, pero no lo forzamos en el código. Todo lo anterior es para decir que es necesario encargarte del tipo de codificación multimedia aceptado en el correspondiente método de presentación además de convertirlo a un tipo de presentación nuevo o devolverlo al tipo de presentación anterior de ser necesario. Después de todo la entrega de información es lo más importante.
tr_tr: Hem Ana hem de Bağımlı Kanal aldıkları veya gönderdikleri medya dosyalarını dönüştürmede görev alabilirler. **Eğer uzaktan sunucudan alınan medya alışılmış formatta değilse, ulaştırmadan önce dönüştür; eğer uzaktan sunucuya gönderilen medyanın spesifik bir formatta olması gerekiyorsa; gönderilmeden önce dönüştürülmeli**. Yine de, bu, medya işleme hakkında kanalların sorumluluğunu ele alan tek kılavuzdur, ve herkesin ortak formatın / kodlamanın ne olduğu hakkında kendi fikri vardır. Bu nedenle biz bu davranımı sadece öneriyoruz, bizim kodlarımızı kullanmanız için sizi zorlamıyoruz. Başka bir deyişle, yine de gösterim metodunuzun yerini tuttuğu kabul edilmiş medya kodlaması tipini dikkate almalısınız ve eğer gerekiyorsa gösterim türünüzü farklı bir türe çevirmeli ve/veya geri çekmelisiniz. Sonuç olarak, bilginin aktarımı daha önemlidir.
zh_cn: 主端和从端都应该对收发的媒体文件的格式负责。一般来说：如果从远程服务器收到的媒体文件不是一个常见的格式，这个文件应该在传递给其他信道之前转码。如果发送到远程服务器的媒体文件有格式要求，则应在发出之前进行转换。然而，我们只提供一个关于媒体格式转换责任的指导建议，毕竟每个人对于常见格式、编码的定义不尽相同。故我们只提供推荐行为，而不在框架内做出强制限制。也就是说，如果信道向框架外输出的媒体文件对格式有所要求，信道仍旧需要检查文件格式，并在必要时转换。毕竟保证信息的传递更为重要。

source: Media encoders
es_ve: Codificadores de los datos multimedia
tr_tr: Ortam kodlayıcılar
zh_cn: 媒体编码器

source: Similarly, we will also not put a strict limit on this as well, but just a recommendation. As you might have already know, there are few mature pure Python media processing libraries, most of them will more or less requires internal or external binary dependencies.
es_ve: De manera similar, nosotros tampoco colocamos un límite estricto en este aspecto, solo una recomendación. Como ya posiblemente sabías existen algunas librerias de procesamiento multimedia muy maduras en Python, la mayoría de ellas requerirán mayor o menor cantidad de dependencias externas.
tr_tr: Benzer şekilde, bunun için de katı bir sınır koymayacağız, sadece bir öneri. Zaten bildiğiniz gibi, saf Python medya işleme kütüphaneleri azdır, bunların çoğu dahili veya harici ikili bağımlılık gerektirir.
zh_cn: 类似地，我们不会对它做出明确的限制，我们只是提出建议。或许您已经知道了，目前 Python 平台已有数个成熟的媒体处理库，其中大多数都需要用到内置的或是附加的二进制依赖。

source: We try to aim to use as few different libraries as we can, as more library to install means more space, install time, and complexity. While processing media files, we recommend to use the following libraries if possible:
es_ve: Tratamos de apuntar al uso de la menor cantidad de librerías posibles, dado que una mayor cantidad significa mayor espacio, tiempo de instalación, y complejidad. Al procesar los archivos multimedia, recomendamos el uso de las siguientes librerias de ser posible:
tr_tr: Yapabildiğimiz kadar farklı birkaç belgeliği kullanmayı amaçlamayı deniyoruz, çünkü yüklenecek daha çok belgelik demek, daha çok alan, yükleme zamanı ve karışıklık demektir. Medya dosyalarını işlerken, eğer mümkünse aşağıdaki belgelikleri kullanmanızı öneriyoruz:
zh_cn: 尽可能少地使用不同的外部代码库。多一个外部代码库依赖就意味着用户需要更多的时间和空间，并且提升了安装的复杂性。在处理媒体文件时，我们建议尽可能使用以下的库：

source: Files in messages
es_ve: Archivos en mensajes
tr_tr: Mesajlardaki dosyalar
zh_cn: 消息中的文件

source: When a file sent out from a channel, it should be open, sought back to 0 ( ``file.seek(0)`` ) before sending.
es_ve: Cuando un archivo es enviado desde un canal, debe ser abierto y devuelto 0 ( ``file.seek(0)`` ) antes de enviar.
tr_tr: Bir kanaldan bir dosya gönderildiği zaman, dosya açılmalıdır, göndermeden önce 0 'a ( ``file.seek(0)`` ) geri döndü.
zh_cn: 从信道发出的文件对象都应该为打开的状态、且文件指针应该定位于 0（``file.seek(0)``）。

source: Files sent should be able to be located somewhere in the file system, better with a appropriate extension name, but not required. All files should also have its MIME type specified in the message object. If the channel is not sure about the correct MIME type, it can try to guess with ``libmagic``, or fallback to ``application/octet-stream``. Always try the best to provide the most suitable MIME type when sending.
es_ve: Los archivos enviados deben poder ser localizados en algún lugar del archivo de sistema., mucho mejor con un nombre de extensión adecuado, aunque no es requerido. Todos los archivos deben tener su tipo de MIME especificado en el objeto mensaje correspondiente. Si el canal no esta seguro acerca del tipo de MIME correcto, el puede tratar de suponerlo con `libmagic``, o como segunda opción ``application/octet-stream``. Siempre trata de utilizar el tipo MIME más adecuado al enviar el mensaje.
tr_tr: Gönderilen dosyaların dosya sisteminin içinde bir yerlerde olduğunun belirlenebilmesi gereklidir, uygun bir uzantı isminin olması daha iyidir, fakat şart değildir. Ek olarak, mesaj modelinde tüm dosyalar kendi spesifik MIME tipine sahip olmalıdır. Eğer kanal doğru MIME türünden emin değilse, ``libmagic`` ile tahmin etmeyi deneyebilir, veya ``application/octet-stream``e geri çekilebilir. Gönderirken her zaman en uygun MIME türünü sağlamaya çalışın.
zh_cn: 所有发出的都应该能在文件系统中找到，并最好有附有相应的扩展名。在发送文件的同时也应该在消息对象中指定其 MIME 类型。如果文件的 MIME 类型不明确，可以尝试用 ``libmagic`` 猜测，或者使用最基本的 ``application/octet-stream``。发送文件是应尽可能提供准确的 MIME 类型。

source: For such files, we use ``close`` to signify the end of its lifecycle. If the file is not required by the sender's channel anymore, it can be safely discarded.
es_ve: Para esos archivos, utilizamos ``close`` para señalar el final del ciclo de vida. Si el archivo ya no es requerido por el canal de envío, puede ser descartado de manera segura.
tr_tr: Bu gibi dosyalar için, biz ömrünün sonunu göstermek için "kapat" kelimesini kullandık. Eğer dosya artık gönderenin kanalı tarafından gerekli değilse, güvenli bir şekilde atılabilir.
zh_cn: 发出的文件会通过 ``close`` 来标记其的生命周期的结束。如果消息的来源信道也不再需要它的话，该文件此时就被安全地丢弃了。

source: Generally, ``tempfile.NamedTemporaryFile`` should work for ordinary cases.
es_ve: Generalmente, ``tempfile.NamedTemporaryFile`` debería funcionar para los casos convencionales.
tr_tr: Genel olarak, ``tempfile.NamedTemporaryFile`` olağan durumlar için çalışmalıdır.
zh_cn: 一般来讲，``tempfile.NamedTemporaryFile`` 应该能适用于大多数情况。
