Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/packaging.po
Languages: id_id

source: Packaging and Publish
id_id: Mengemas dan mempublikasi

source: Publish your module on PyPI
id_id: Terbitkan modul anda pada PyPI

source: Publish modules on PyPI is one of the easiest way for users to install your package. Please refer to related documentation and tutorials about PyPI and pip for publishing packages.
id_id: Mencantumkan modul pada PyPI adalah salah satu cara paling mudah bagi pengguna untuk memasang paket anda. Silakan melihat ke dokumentasi dan tutorial yang terkait tentang PyPI dan pip untuk paket penerbitan.

source: For EFB modules, the package is recommended to have a name starts with ``efb-``, or in the format of ``efb-platform-type``, e.g. ``efb-irc-slave`` or ``efb-wechat-mp-filter-middleware``. If there is a collision of name, you can adjust the package name accordingly, but please start the package name with ``efb-``.
id_id: Untuk EFB modul, paket dianjurkan untuk memiliki nama yang dimulai dengan `efb-`, atau dalam format `efb-platform-type`, misalnya `efb-irc-budak` atau `efb-wechat-mp-filter-middleware`. Jika ada tabrakan nama, anda dapat menyesuaikan nama paket sesuai, tapi segera memulai paket dengan nama `efb-`.

source: Module discovery
id_id: Modul penemuan

source: EH Forwarder Bot uses `Setuptools' Entry Point feature`__ to discover and manage channels and middlewares. In your ``setup.py`` script or ``.egg-info/entry_points.txt``, specify the group and object as follows:
id_id: EH Forwarder Bot menggunakan `Setuptools' Entry Point fitur`__ untuk menemukan dan mengelola saluran dan middlewares. `Setup.py` script atau `.egg-info/entry_points.txt`, menentukan kelompok dan objek sebagai berikut:

source: Group for master channels: ``ehforwarderbot.master``
id_id: Grup untuk saluran utama: ``ehforwarderbot.master``

source: Group for slave channels: ``ehforwarderbot.slave``
id_id: Grup untuk saluran slave: ``ehforwarderbot.slave``

source: Group for middlewares: ``ehforwarderbot.middleware``
id_id: Grup untuk middlewares: ``ehforwarderbot.middleware``

source: Convention for object names is ``<author>.<platform>``, e.g. ``alice.irc``. This should also be your module's ID.
id_id: Konvensi untuk nama objek adalah ``<author>.<platform>``, misalnya ``alice.irc``. Ini juga harus menjadi ID modul anda.

source: Object reference should point to your module's class, which extends either ``EFBChannel`` or ``EFBMiddleware``.
id_id: Referensi objek harus menunjuk ke modul kelas, yang meluas baik `EFBChannel` atau `EFBMiddleware`.

source: Example
id_id: Contoh

source: Private modules
id_id: Modul pribadi

source: If you want to extend from, or make changes on existing modules for your own use, you can have your modules in the private modules :doc:`directory <../directories>`.
id_id: Jika anda ingin mengembangkan dari, atau membuat perubahan pada modul yang ada untuk digunakan secara pribadi, anda dapat memiliki modulnya di modul pribadi :doc:`direktori <../directories>`.
