Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/slave.po
Languages: es_ve, id_id, tr_tr

source: Slave channels
es_ve: Canales esclavos
id_id: Saluran budak
tr_tr: Bağımlı kanallar

source: Slave channel is more like a wrap over an API of IM, it encloses messages from the IM into appropriate objects and deliver it to the master channel.
es_ve: Los canales esclavos son mas que un simple empaquetado sobre los API de un IM, el anexa los mensajes provenientes de un IM dentro de un objeto y los envía al canal maestro.
id_id: Saluran budak lebih mirip bungkus API IM, itu melampirkan pesan dari IM ke objek yang sesuai dan mengirimkannya ke saluran induk.
tr_tr: Bağımlı kanal, IM'nin API'si üzerindeki bir pakete benziyor, IM'den gelen iletileri uygun nesnelere ekler ve onu ana kanala teslim eder.

source: Although we suggest that slave channel should match with an IM platform, but you may try to model it for anything that can deliver information as messages, and has a limited list of end-points to deliver messages to and from as chats.
es_ve: Aunque nosotros sugerimos que los canales esclavos deben coincidir con una plataforma de IM, puedes tratar de modelarlo como cualquier elemento que pueda enviar información como mensajes y además cuenta con una lista de terminales a los cuales enviar mensajes desde y hasta los chats.
id_id: Meskipun kami menyarankan agar saluran budak harus sesuai dengan platform IM, akan tetapi anda dapat mencoba menyesuaikan untuk segala hal yang dapat mengirimkan informasi sebagai pesan, dan memiliki batasan daftar poin akhir untuk menyampaikan pesan ke dan dari obrolan.
tr_tr: Bağımlı kanalın bir IM platformuyla eşleşmesi gerektiğini önermemize rağmen, bilgileri mesaj olarak iletebilen her şey için modellemeyi deneyebilirsiniz, ve sohbetlere ve sohbetlerden mesaj iletmek için son noktaların sınırlı bir listesine sahiptir.

source: In most of the cases, slave channels should be identified as one single user from the IM platform, instead of a bot. We suggest you to use a bot for slave channels only when
es_ve: En la mayoría de los casos, los canales esclavos deben ser identificados como un solo usuario proveniente de la plataforma IM. en vez de un bot. Sugerimos que uses un bot para los canales esclavos solo cuando
tr_tr: Çoğu durumda bağımlı kanallar, bot yerine IM platformundan tek bir kullanıcı olarak tanımlanmalıdır. Bağımlı kanallar için bir bot kullanmanızı sadece bu zamanda öneririz

source: the IM platform puts no difference between a user and a bot, or
es_ve: la plataforma IM no reconoce ninguna diferencia entre un usuario y un bot o
id_id: platform IM tidak membedakan antara pengguna dan bot, atau
tr_tr: IM platformu kullanıcı ve bot arasında fark etmez, veya

source: bots on the IM platform can do exactly same things, if not more, as a user, and bots can be created easier than user account.
es_ve: los bots en la plataforma IM pueden hacer exactamente las mismas cosas o incluso más que como usuarios, además los bots pueden ser creados de manera más sencilla que las cuentas de usuario.
id_id: bot pada platform IM bisa melakukan hal yang sama persis, jika tidak lebih, sebagai pengguna, dan bot bisa dibuat lebih mudah daripada akun pengguna.
tr_tr: iM platformundaki botlar, aynı şeyleri bir kullanıcı olarak yapabilir, eğer daha fazla değilse, bir kullanıcı olarak, botlar kullanıcı hesabından daha kolay oluşturulabilir.

source: Methods to be implemented
es_ve: Métodos a ser implementados
id_id: Metode untuk diimplementasikan
tr_tr: Uygulanacak yöntemler

source: Below is a list of methods that are required to be implemented by the slave channel.
es_ve: Abajo se encuentra una lista de métodos que son necesarios que sean implementados por el canal esclavo.
id_id: Di bawah ini sebuah daftar metode yang diperlukan untuk diimplementasikan oleh saluran budak.
tr_tr: Bağımlı kanal tarafından uygulanması gereken yöntemlerin listesi aşağıdadır.

source: :meth:`.EFBChannel.get_chat`
tr_tr: :meth:`.EFBChannel.get_chat_picture`

source: Additional features
es_ve: Características adicionales
id_id: Fitur tambahan
tr_tr: Ek özellikler

source: Slave channels can offer more functions than what EFB requires, such as creating groups, search for friends, etc, via *additional features*.
es_ve: Los canales esclavos pueden ofrecer más funciones de las que EFB requiere, tales como la creación de grupos, la búsqueda de amigos, etc, por medio de las *características adicionales*.
id_id: Saluran budak dapat menawarkan fungsi yang lebih dari apa yang EFB membutuhkan, seperti membuat kelompok, mencari teman, dll, melalui *fitur tambahan*.
tr_tr: Bağımlı kanallar, EFB'nin ihtiyaç duyduğu grup oluşturma, arkadaş arama vb. gibi *ek özellikler* yoluyla daha fazla işlev sunabilir.

source: ``desc`` should describe what the feature does and how to use it. It's more like the help text for an CLI program. Since method of invoking the feature depends on the implementation of the master channel, you should use ``"{function_name}"`` as its name in ``desc``, and master channel will replace it with respective name depend on their implementation.
es_ve: ``desc`` debe describir que hace la función y como es utilizada. Es más como el texto de ayuda de un programa CLI. Como el método para invocar la función depende de la implementación del canal maestro, deberías utilizar ``"{function_name}"`` como el nombre en ``desc``, y el canal maestro lo reemplazará con su respectivo nombre dependiendo de su implementación.
id_id: `desc` harus menjelaskan apa fitur tersebut dan bagaimana menggunakannya. Itu lebih seperti teks bantuan untuk program CLI. Sejak metode yang menerapkan fitur ini tergantung pada implementasi master channel, anda harus menggunakan ``"{function_name}"`` sebagai nama di ``desc``, dan saluran master akan menggantinya dengan masing-masing nama tergantung pada pelaksanaannya.
tr_tr: `` desc`` özelliğin ne yaptığını ve nasıl kullanılacağını açıklar. Daha çok bir CLI programı için yardım metnine benzer. Özelliği çağırma yöntemi ana kanalın uygulanmasına bağlı olduğu için, `` desc`` içindeki adı olarak `` "{function_name} "` `i kullanmalısınız ve ana kanal, bunların uygulanmasına bağlı olarak kendi adıyla değiştirecektir.

source: The method should in the end return a string, which will be shown to the user as its result. Depending on the functionality of the feature, it may be just a simple success message, or a long chunk of results.
es_ve: El método debe retornar al finalizar un string, el cual será el resultado mostrado al usuario. Dependiendo del funcionamiento de la función, puede ser un simple mensaje de éxito o una larga cadena de resultados.
id_id: Metode harus di mengembalikan sebuah tali yang akan ditampilkan kepada pengguna sebagai hasilnya. Tergantung pada fungsi dari fitur ini, mungkin hanya sederhana pesan sukses, atau panjang potongan hasil.
tr_tr: Yöntem en sonunda, sonuçta kullanıcıya gösterilecek bir dizeye dönmelidir. Özelliğin işlevselliğine bağlı olarak, yalnızca basit bir başarı mesajı veya uzun bir sonuç yığını olabilir.

source: Callable name of such methods has a more strict standard than a normal Python 3 identifier name, for compatibility reason. An additional feature callable name should:
id_id: Callable nama dari metode tersebut memiliki lebih ketat daripada standar normal Python 3 nama pengenal, untuk alasan kompatibilitas. Fitur tambahan callable nama harus:
tr_tr: Bu gibi yöntemlerin çağrılabilir adı, uyumluluk nedeni ile normal bir Python 3 tanımlayıcı adından daha sıkı bir standarda sahiptir. Ek bir özellik çağrılabilir adı olmalıdır:

source: be case sensitive
es_ve: sensible a letras mayúsculas y minúsculas
id_id: menjadi peka
tr_tr: büyük/küçük harfe duyarlı

source: include only upper and lower-case letters, digits, and underscore.
es_ve: incluir solo letras mayúsculas y minúsculas, dígitos y guion bajo.
id_id: hanya termasuk huruf besar, huruf kecil, dan garis bawah.
tr_tr: yalnız büyük ve küçük harfler, rakamlar ve altçizgi içerir.

source: does not start with a digit.
id_id: tidak dimulai dengan angka.
tr_tr: bir basamakla başlamaz.

source: be in a length between 1 and 20 inclusive
es_ve: estar dentro de un tamaño entre 1 y 20 inclusivo
id_id: berada di suhu udara turun menjadi antara 1 dan 20 inklusif
tr_tr: 1 ve 20 arasında bir uzunlukta olmalı

source: *be as short and concise as possible, but keep understandable*
es_ve: * ser lo más corto y conciso posible, pero mantenerse comprensible
id_id: *Jadilah sesingkat dan ringkas mungkin, tapi tetap mengerti*
tr_tr: *mümkün olduğunca kısa ve öz olun, fakat anlaşılabilir tutun*

source: In RegEx, it's can be expressed as::
es_ve: En RegEx, puede ser expresado como::
id_id: Dalam RegEx, itu dapat dinyatakan sebagai::
tr_tr: RegEx'de şu şekilde ifade edilebilir::

source: Example
es_ve: Ejemplo
id_id: Contoh
tr_tr: Örnek

source: Message commands
es_ve: Comandos de mensaje
id_id: Perintah pesan
tr_tr: Mesaj komutları

source: Message commands are usually sent by slave channels so that users can respond to certain messages that has specific required actions.
es_ve: Los comandos de mensajes usualmente son enviados por los canales esclavos de manera que los usuarios puedan responder a ciertos mensajes que requieran acciones específicas.
id_id: Perintah pesan biasanya dikirim oleh saluran budak sehingga pengguna dapat merespon pesan tertentu yang memiliki tindakan khusus yang diperlukan.
tr_tr: Mesaj komutları genellikle bağımlı kanallar tarafından gönderilir, böylece kullanıcılar gerekli eylemlere sahip mesajlara cevap verebilir.

source: Possible cases when message commands could be useful:
id_id: Mungkin kasus-kasus ketika perintah pesan dapat berguna:
tr_tr: Mesaj komutlarının yararlı olabileceği olası durumlar:

source: Add as friends when a contact card is received.
id_id: Tambahkan sebagai teman ketika kontak kartu diterima.
tr_tr: Bir kartvizit alındığında arkadaş olarak ekleyin.

source: Accept or decline when a friend request is received.
id_id: Menerima atau menolak ketika permintaan teman diterima.
tr_tr: Arkadaş talebi alındığında kabul veya reddedin.

source: A message can be attached with a ``list`` of commands, in which each of them has:
es_ve: Un mensaje puede ser adjuntado con una ``list`` de comandos, en el que cada uno de ellos tiene:
id_id: Sebuah pesan anda dapat melampirkan ``daftar`` perintah, di mana masing-masing dari mereka memiliki:
tr_tr: Bir mesaj, her biri aşağıdakileri içeren bir ``liste`` komutuyla eklenebilir:

source: a human-friendly name,
es_ve: un nombre legible
id_id: manusia-nama,
tr_tr: insan dostu bir isim,

source: a callable name,
es_ve: un nombre de invocación,
tr_tr: çağrılabilir bir isim,

source: a ``list`` of positional arguments (``*args``), and
es_ve: una ``list`` de argumentos posicionales (``*args``) y
tr_tr: konumsal argümanlardan oluşan bir ``list``(`` * args``), ve

source: a ``dict`` of keyword arguments (``**kwargs``)
es_ve: un ``dict`` de argumentos por palabras claves (``**kwargs``)
tr_tr: anahtar kelime argümanlarından oluşan bir ``dict``(``**kwargs``)

source: When a user clicked the button, the corresponding method of your channel will be called with provided arguments.
es_ve: Cuando un usuario presiona el botón, el método correspondiente de tu canal será llamada con los argumentos proporcionados.
id_id: Saat pengguna mengklik tombolnya, metode yang cocok dari saluran anda akan dipanggil dengan alasan-alasan yang akan diberikan.
tr_tr: Kullanıcı butona tıkladığında, kanalınızın karşılık gelen metodu sağlanmış argümanlarla birlikte çağrılacaktır.

source: Note that all such methods MUST return a ``str`` as a respond to the action from user, and they should NOT raise any exception to its caller. Any exceptions occurred within should be ``expect``\ ed and processed.
es_ve: Nota que todos los métodos deben retornar un ``str``como respuesta a una acción del usuario, y no deben llamar a ninguna excepción de su invocador. Cualquier excepción que ocurra debería ser ``expect``\ ed y procesada.
id_id: Perhatikan bahwa semua metode tersebut HARUS kembali ``str`` sebagai merespon aksi dari pengguna, dan mereka TIDAK harus menaikkan terkecuali untuk para pemanggil. Pengecualian terjadi hanya harus ``mengharapkan``\ ed dan diproses.
tr_tr: Tüm bu yöntemlerin, kullanıcının yaptığı harekete bir yanıt olarak bir `` str`` ​döndürmesi GEREKTİĞİNİ unutmayın ve çağıran kişiye hiç bir istisnaya sebep OLMAMALIDIR. Içinde meydana gelen istisnalar ``beklen``melidir ve işlenmelidir.

source: Message delivery
es_ve: Entrega de mensajes
id_id: Pengiriman pesan
tr_tr: Mesaj teslimi

source: Slave channels should deliver all messages that the IM provides, including what the user sent not with this channel. But it should not deliver message sent from the master channel again back to the master channel as a new message.
es_ve: Los canales esclavos deberían entregar todos los mensajes que el IM proporciona, incluyendo los que el usuario no envió con este canal. Pero no debería enviar un mensaje enviado por una canal maestro otra vez al canal maestro como un nuevo mensaje.
id_id: Budak saluran harus menyampaikan semua pesan bahwa IM menyediakan, termasuk apa yang tidak dikirim pengguna melalui saluran ini. Tapi itu tidak harus memberikan pesan yang dikirim dari saluran utama kembali ke saluran utama sebagai pesan baru.
tr_tr: Bağımlı kanallar, kullanıcının bu kanalla göndermediği şeyler de dahil olmak üzere IM'in sağladığı tüm iletileri sağlamalıdır. Fakat, ana kanala gönderilen ileti yeniden ana kanala yeni bir ileti olarak gönderilmemelidir.

source: Messages should be delivered regardless of the notification settings user had in the IM platform, but you can:
es_ve: Los mensajes debería entregarse sin importar la configuración de notificaciones que el usuario tenga en la plataforma IM, pero puedes:
id_id: Pesan harus disampaikan terlepas dari pengaturan pemberitahuan pengguna di platform IM, tapi anda dapat:
tr_tr: Mesajlar kullanıcının IM platformunda mevcut bildirim ayarlarından bağımsız teslim edilmelidir, fakat şunları yapabilirsiniz:

source: include notification settings in the ``vendor_specific`` section of the chats or message object, whichever is applicable, and then let middlewares to decide whether to deliver it; or
es_ve: incluye configuraciones de notificaciones dentro de la sección ``vendor_specific``de los objetos chat o mensajes, cualquiera que aplique, y deja a los middlewares que decidan si entregarlo o no; o
id_id: mencakup pengaturan pemberitahuan di ``vendor_specific`` bagian dari obrolan atau pesan objek, mana yang berlaku, dan kemudian membiarkan middlewares untuk memutuskan apakah akan menyampaikan hal itu; atau
tr_tr: sohbetlerin veya ileti nesnesinin "satıcıya_özgü" bölümüne hangisi uygunsa bildirim ayarlarını ekleyin ve ardından özel yazılımın teslim edip etmeyeceğine karar vermesine izin verin; veya

source: provide options in the slave channel to ignore certain messages provided by the IM server.
es_ve: proporciona opciones dentro del canal esclavo para ignorar ciertos mensajes, proporcionados por el servidor IM,.
id_id: memberikan pilihan dalam saluran budak untuk mengabaikan pesan-pesan tertentu yang disediakan oleh server IM.
tr_tr: iM sunucusu tarafından sağlanan belirli iletileri görmezden gelmek için bağımlı kanalda seçenekler sunun.

source: In most of the cases, slave channels should be identified as one single user from the IM platform, instead of a bot. Â We suggest you to use a bot for slave channels only when
id_id: Pada sebagian besar kasus, saluran budak harus diidentifikasikan sebagai satu pengguna tunggal dari platform IM, bukan sebuah bot. Kami menyarankan anda sebaiknya menggunakan bot hanya untuk saluran budak

source: Such features are accessed by the user in a CLI-like style. An "additional feature" method should only take one string parameter aside from ``self``, and wrap it with :meth:`~ehforwarderbot.utils.extra` decorator. The ``extra`` decorator takes 2 arguments: ``name`` -- a short name of the feature, and ``desc`` -- a description of the feature with its usage.
id_id: Fitur tersebut dapat diakses oleh pengguna di CLI-seperti gaya. "Fitur tambahan" metode hanya harus mengambil satu parameter string selain dari ``diri``, dan membungkusnya dengan :meth:`~ehforwarderbot.utils.extra` dekorator. ``Ekstra`` dekorator membutuhkan 2 argumen: ``nama`` -- nama pendek dari fitur, dan ``desc`` -- sebuah deskripsi dari fitur dengan penggunaannya.

source: The callable should not raise any exception to its caller. Any exceptions occurred within should be ``expect``\ ed and processed.
es_ve: La función invocable no debe llamar a ninguna excepción del invocador. Cualquier excepción ocurrida dentro debe ser ``expect``\ ed y procesada.
id_id: Callable tidak harus menaikkan terkecuali untuk para pemanggil. Pengecualian terjadi hanya harus ``mengharapkan``\ ed dan diproses.

source: Like / thumb up to a message if applicable.
id_id: Sukai / jempol ke pesan jika berlaku.
