Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/storage.po
Languages: tr_tr

source: Configurations and storage
tr_tr: Konfigürasyon ve depolama

source: Configurations and Permanent Storage
tr_tr: Konfigürasyon ve Kalıcı Depolama

source: As described in :doc:`/directories`, each module has been allocated with a folder per profile for configurations and other storage. The path can be obtained using :meth:`~.ehforwarderbot.utils.get_data_path` with your module ID. All such storage is specific to only one profile.
tr_tr: :doc: `/directories` bölümünde anlatıldığı gibi, her modül konfigürasyonlar ve diğer depolama için profil başına bir klasör ile ayrılmıştır. Yol, modül kimliğinizle :meth: `~ .ehforwarderbot.utils.get_data_path` kullanılarak elde edilebilir. Bu tür depolama birikimi yalnızca bir profile özeldir.

source: For configurations, we recommend to use ``<module_data_path>/config.yaml``. Similarly, we prepared :meth:`~.ehforwarderbot.utils.get_config_path` to get the path for default config file. Again, you are not forced to use this name or YAML as the format of your config file.
tr_tr: Konfigürasyonlar için, bunu kullanmanızı öneririz ``<module_data_path>/config.yaml``. Benzer olarak, bunu hazırladık :meth:`~.ehforwarderbot.utils.get_config_path`varsayılan konfig. dosyası için yolu alabilmek için. Yine, konfig. dosyanızın formatı için bu ismi veya YAML kullanmak için zorlanmıyorsunuz.

source: Usually in the storage folder lives:
tr_tr: Genellikle depolama klasöründe bulunur:

source: Configuration files
tr_tr: Yapılandırma dosyaları

source: User credentials / Session storage
tr_tr: Kullanıcı kimlik bilgileri / Geçici depolama

source: Databases
tr_tr: Veri tabanları

source: Temporary Storage
tr_tr: Geçici Depolama

source: While processing multimedia messages, we inevitably need to store certain files temporarily, either within the channel or across channels. Usually, temporary files can be handled with Python's ``tempfile`` library.
tr_tr: Multimedya mesajları işlenirken, kaçınılmaz olarak, belirli dosyaları geçici olarak, kanal içinde veya kanallar arasında saklamalıyız. Genellikle, geçici dosyalar Python'un ``tempfile`` kütüphanesi ile işlenebilir.
