Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/guide/walkthrough.po
Languages: es_ve, id_id, zh_cn

source: Walk-through — How EFB works
es_ve: Tutorial — Cómo funciona EFB
zh_cn: EFB 工作原理

source: EH Forwarder Bot is an extensible framework that allows user to control and manage accounts from different chat platforms in a unified interface. It consists of 4 parts: a Master Channel, some Slave Channels, some Middlewares and a Coordinator.
es_ve: EH Forwarder Bot es un marco de desarrollo extensible que permite al usuario controlar y administrar las cuentas de diferentes plataformas de chat en una interfaz unificada. Consta de 4 partes: Un canal maestro, algunos canales esclavos, algunos middlewares y un coordinador.
id_id: EH Forwarder Bot adalah kerangka kerja yang bisa diperluas yang memungkinkan pengguna mengontrol dan mengelola akun dari platform obrolan yang berbeda di antarmuka yang dipersatukan. Ini terdiri dari 4 bagian: Saluran Utama, beberapa Saluran Cabang, beberapa Middleware dan Koordinator.
zh_cn: EH Forwarder Bot 是一个可扩展的框架，允许用户使用统一的接口来控制和管理不同聊天平台的账户。它包含四个部分：一个主端，一些从端，一些中间件和一个协调器。

source: Master Channel
es_ve: Canal Maestro
id_id: Saluan Inti
zh_cn: 主端

source: The channel that directly interact with the user. There is guaranteed to have one and only one master channel in an EFB Session.
es_ve: El canal que interactúa directamente con el usuario. Se garantiza que tendrá uno y solo un canal principal en una sesión de EFB.
id_id: Saluran yang berhubungan langsung dengan pengguna. Adanya jaminan untuk mempunyai satu dan hanya satu saluran utama dalam Sesi EFB.
zh_cn: 直接和用户交互的信道。在 EFB 会话中保证有且只有一个主端。

source: Slave Channel
es_ve: Canal Esclavo
zh_cn: 从端

source: The channel that delivers messages to and from their relative platform. There should be at lease one slave channel in an EFB Session.
es_ve: El canal que entrega mensajes hacia y desde su plataforma relativa. Debería haber al menos un canal esclavo en una sesión de EFB.
id_id: Saluran yang menghantarkan ke pesan dan dari platform relatif mereka. Ada yang harus di sewa satu saluran budak di sebuah sesi EFB.
zh_cn: 该信道向相关平台发送和接收消息。在一个 EFB 会话中应该有至少一个从端。

source: Coordinator
es_ve: Coordinador
id_id: Koordinator
zh_cn: 协调器

source: Component of the framework that maintains the instances of channels, and delivers messages between channels.
es_ve: Componente del framework que mantiene las instancias de canales y la entrega de mensajes entre los canales.
id_id: Komponen kerangka kerja yang menyimpan contoh saluran, dan mengirim pesan antar saluran.
zh_cn: 框架中用来维护信道实例的组件，同时负责在信道间传递消息。

source: Middleware
id_id: Peranti tengah
zh_cn: 中间件

source: Module that processes messages and statuses delivered between channels, and make modifications where needed.
es_ve: Módulo que procesa los mensajes y estados entregados entre canales, y realiza modificaciones cuando es necesario.
id_id: Modul yang memproses pesan dan status terkirim antara saluran, dan membuat perubahan dimana diperlukan.
zh_cn: 用来在信道间处理消息及状态的组件，同时会在需要时做出相应的修改。

source: Concepts to know
es_ve: Conceptos a saber
id_id: Konsep untuk mengetahui
zh_cn: 需要了解的概念

source: Module
es_ve: Módulo
id_id: Modul
zh_cn: 模块

source: A common term that means both channels and middlewares.
es_ve: Un término común que se refiere a ambos canales y middlewares.
id_id: Istilah umum yang berarti kedua saluran dan middleware.
zh_cn: 指代信道和中间件的通称。

source: Chat
id_id: Obrolan
zh_cn: 会话

source: A place where conversations happen. Consists of User Chats (private messages), Group Chats, and System Chats.
es_ve: Un lugar donde ocurren conversaciones. Consta de Usuarios de Chat (mensajes privados), Grupos de Chat y Sistemas de Chat.
id_id: Sebuah tempat dimana percakapan terjadi. Terdiri dari Pengguna Obrolan (pesan pribadi), Obrolan Kelompok, dan Obrolan Sistem.
zh_cn: 对话发生的场所。包含用户聊天（私聊）、群组、和系统会话。

source: User / User Chat
es_ve: Usuario / Usuario de Chat
id_id: Pengguna / Pengguna Obrolan
zh_cn: 用户、用户会话

source: A user of the IM platform that the user can possibly chat with, or a conversation with them. Messages from such conversation has one and only one unique author. *(Except messages that are from the user themself, or from the system.)*
es_ve: Un usuario de la plataforma de mensajería instantánea con el que el usuario puede chatear, o una conversación con ellos. Los mensajes de dicha conversación tienen uno y sólo un autor único. *(Excepto mensajes que son del usuario mismo, o del sistema.)*
id_id: Pengguna platform IM yang mungkin dapat diajak obrolan dengan pengguna, atau percakapan dengan mereka. Pesan dari percakapan semacam itu hanya memiliki satu dan hanya satu penulis unik. *(Kecuali pesan yang berasal dari pengguna itu sendiri, atau dari sistem.)*
zh_cn: 可以与其产生会话的即时通讯平台账户。来自于这些会话的消息有且仅有一个唯一的作者。 *（除了来自用户自己或系统的消息）*

source: For platforms that support bot or something similar, they would also be considered as a "user", unless messages in such chat can be sent from any user other than the bot.
es_ve: Para plataformas compatibles con bot o algo similar, también serían considerados como un "usuario", a menos que los mensajes en dicho chat puedan ser enviados desde cualquier usuario que no sea el bot.
id_id: Untuk platform yang mendukung bot atau sesuatu yang serupa, mereka juga akan dianggap sebagai seorang "pengguna", kecuali kalau pesan dalam obrolan tersebut dapat dikirim dari pengguna lain manapun selain bot.
zh_cn: 对于支持机器人或者类似功能的平台，它们也应该被看作为一个「用户」，除非机器人不能发送消息。

source: For chats that the user receive messages, but cannot send message to, it should also be considered as a user chat, only to raise an exception when messages was trying to send to the chat.
es_ve: Para los chats en los que el usuario recibe mensajes, pero no pueden enviar mensajes, también puede considerarse un chat de usuario, haciendo una excepción cuando se intentan enviar mensajes al chat.
id_id: Untuk obrolan yang mana pengguna menerima pesan, tapi tidak bisa mengirim pesan ke, pesan itu juga harus dianggap sebagai obrolan pengguna, hanya untuk meningkatkan pengecualian saat pesan mencoba dikirim ke obrolan.
zh_cn: 对于用户只能接受而不能发送消息的会话，它也应该被视为一个「用户会话」，且在发送消息至这些会话时抛出异常。

source: Group chat
es_ve: Grupo de chat
id_id: Obrolan kelompok
zh_cn: 群组会话

source: A chat that involves more than one user. A group chat should have a list of members (users) that can involve in the conversation.
es_ve: Un chat quen involucra a más de un usuario. Un grupo de chat debe tener una lista de miembros (usuarios) que estén presentes en la conversación.
id_id: Obrolan yang melibatkan lebih dari satu pengguna. Obrolan kelompok harus memiliki daftar anggota (pengguna) yang bisa terlibat dalam percakapan.
zh_cn: 涉及多个用户的会话。群聊应该有一个可以参与对话的成员（用户）列表。

source: System chat
es_ve: Sistema de chat
id_id: Sistem chatting
zh_cn: 系统会话

source: A chat that is a part of the system. Usually used for chats that are either a part of the IM platform, or the channel. Slave channels can use this feature to send system message and notifications to the master channel.
es_ve: Un chat que es parte del sistema. Usualmente se usa para chats que son parte de la plataforma de mensajería instantánea o del canal. Los canales esclavos pueden usar esta función para enviar mensajes del sistema y notificaciones al canal maestro.
id_id: Obrolan yang menjadi bagian dari sistem. Biasanya digunakan untuk obrolan yang menjadi bagian dari platform IM, atau saluran. Saluran cabang bisa menggunakan fitur ini untuk mengirim pesan dan pemberitahuan sistem ke saluran inti.
zh_cn: 作为系统构成部分的会话。通常用于平台或通道内的聊天。从端可以使用这个功能来发送系统消息和通知给主端。

source: Message
es_ve: Mensaje
id_id: Pesan
zh_cn: 消息

source: Messages are delivered strictly between the master channel and a slave channel. It usually carries an information of a certain type.
es_ve: Los mensajes son entregados estrictamente entre el canal maestro y el canal esclavo. Usualmente lleva información de cierto tipo.
id_id: Pesan yang disampaikan secara ketat antara guru saluran dan saluran budak. Hal ini biasanya membawa informasi dari jenis tertentu.
zh_cn: 消息只能在主端与从端之间传递。它通常包含特定类型的信息。

source: Each message should at least have a unique ID that is distinct within the slave channel related to it. Any edited message should be able to be identified with the same unique ID.
es_ve: Cada mensaje debe tener al menos una ID única que sea distinta dentro del canal esclavo relacionado con ella. Cualquier mensaje editado debe identificarse con la misma ID única.
id_id: Setiap pesan setidaknya harus memiliki ID unik yang berbeda dalam saluran budak berhubungan dengan itu. Setiap pesan yang disunting harus dapat diidentifikasi dengan ID unik yang sama.
zh_cn: 每个消息都至少含有一个在该从端内的唯一 ID。任何编辑过的消息应该可以通过相同的唯一 ID 被识别。

source: Status
es_ve: Estado
zh_cn: 状态

source: Information that is not formatted into a message. Usually includes updates of chats and members of chats, and removal of messages.
es_ve: Información que no está formateada en un mensaje. Usualmente incluye actualizaciones de chats y miembros de chats, y eliminación de mensajes.
id_id: Informasi yang tidak diformat ke dalam pesan. Biasanya termasuk pembaruan obrolan dan anggota obrolan, dan penghapusan pesan.
zh_cn: 不能包装为消息的其他信息。通常包含聊天和聊天成员的更新，以及消息的删除。

source: Slave Channels
es_ve: Canales Esclavos
id_id: Saluran Slave
zh_cn: 从端

source: The job of slave channels is relatively simple.
es_ve: El trabajo de los canales esclavos es relativamente simple.
id_id: Tugas dari saluran budak relatif sederhana.
zh_cn: 从端的工作相对简单。

source: Deliver messages to and from the master channel.
es_ve: Entrega mensajes para y desde el canal principal.
id_id: Menyampaikan pesan ke dan dari saluran utama.
zh_cn: 传递来往于主端的消息。

source: Maintains a list of all available chats, and group members.
es_ve: Mantiene una lista de todos los chats disponibles, y los miembros del grupo.
id_id: Mengelola sebuah daftar dari semua obrolan yang tersedia, dan anggota kelompok.
zh_cn: 维护所有可用会话和群组成员的列表。

source: Monitors changes of chats and notify the master channel.
es_ve: Monitorea los cambios de los chat y notifica al canal principal.
id_id: Monitor perubahan obrolan dan memberitahukan saluran inti.
zh_cn: 监视会话信息的变更并通知主端。

source: Features that does not fit into the standard EFB Slave Channel model can be offered as :ref:`slave-additional-features`.
es_ve: Las características que no encajen dentro del modelo estándar del canal esclavo EFB pueden ser ofrecidas como :ref:`slave-additional-features`.
id_id: Fitur-fitur yang tidak sesuai dengan standar EFB model Saluran Budak dapat ditawarkan sebagai :ref:`budak-tambahan-fitur`.
zh_cn: 在标准的 EFB 从端模型外的附加功能可以通过 :ref:`slave-additional-features` 来提供。

source: Master Channels
es_ve: Canales Maestros
id_id: Saluran Inti
zh_cn: 主端

source: Master channels is relatively more complicated and also more flexible. As it directly faces the user, its user interface should be user-friendly, or at least friendly to the targeted users.
es_ve: Los canales maestros son relativamente más complicados y también más flexibles. Como está directamente con el usuario, su interfaz debe ser simple de usar, o al menos amistoso para los usuarios específicos.
id_id: Saluran inti ini relatif lebih rumit dan juga lebih fleksibel. Karena berhadapan langsung dengan pengguna, antarmuka pengguna harus pengguna yang ramah, atau setidaknya cocok untuk pengguna yang ditargetkan.
zh_cn: 主端相对来说更加复杂同时也更灵活。由于它直接面向用户，它的界面应该对用户友好，至少对于目标用户友好。

source: The job of the master channel includes:
es_ve: El trabajo del canal maestro incluye:
id_id: Pekerjaan dari saluran inti termasuk:
zh_cn: 主端的工作包括：

source: Receive, process and display messages from slave channels.
es_ve: Recibe, procesa y muestra mensajes de los canales esclavos.
id_id: Menerima, memproses dan menampilkan pesan dari budak saluran.
zh_cn: 接收，处理和显示来自从端的消息。

source: Display a full list of chats from all slave channels.
es_ve: Muestra una lista completa de todos los chats de los canales esclavos.
id_id: Menampilkan daftar lengkap dari obrolan dari semua budak saluran.
zh_cn: 显示来自所有从端的完整会话列表。

source: Offer an interface for the user to use "extra functions" from slave channels.
es_ve: Ofrecer una interfaz para que el usuario use "funcionalidades adicionales" de los canales esclavos.
id_id: Menawarkan sebuah antarmuka kepada pengguna untuk menggunakan "fungsi tambahan" dari saluran budak.
zh_cn: 提供一个让用户使用来自从端的「附加功能」的界面。

source: Process updates from slave channels.
es_ve: Procesar las actualizaciones de canales esclavos.
id_id: Memproses pembaruan dari saluran budak.
zh_cn: 处理来自从端的更新。

source: Provide a user-friendly interface as far as possible.
es_ve: Proporcionar una interfaz fácil de usar en la medida de lo posible.
id_id: Berikan antarmuka yang mudah digunakan sejauh mungkin.
zh_cn: 尽可能提供一个用户友好的界面。

source: Middlewares
zh_cn: 中间件

source: Middlewares can monitor and make changes to or nullify messages and statuses delivered between channels. Middlewares are executed in order of registration, one after another. A middleware will always receive the messages processed by the preceding middleware if available. Once a middleware nullify a message or status, the message will not be processed and delivered any further.
es_ve: Los middleewares pueden monitorear y hacer cambios para anular mensajes y estados entregados entre canales. Los middlewares son ejecutados por orden de registro, uno tras otro. Un middleware siempre va a recibir los mensajes procesados por el middleware anterior si está disponible. Una vez que un middleware anule un mensaje o un estado, el mensaje no será procesado ni entregado.
id_id: Middlewares dapat memantau dan membuat perubahan atau membatalkan pesan dan status disampaikan antara saluran. Middlewares dieksekusi dalam urutan pendaftaran, satu demi satu. Sebuah middleware akan selalu menerima pesan-pesan yang diproses jika sebelumnya middleware tersedia. Sekali middleware membatalkan pesan atau status, pesan tidak akan diproses dan disampaikan lebih lanjut.
zh_cn: 中间件可以监视，更改或拦截在通道间传递的消息和状态。中间件按照注册的顺序一个接一个的执行。 如果存在，中间件会始终接受被上一个中间件处理过的消息。一旦中间件拦截了消息或状态，该消息将不再被进一步处理。
