Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: id_id

source: How to contribute
id_id: Bagaimana cara berkontribusi

source: First of all, thanks for taking your time to contribute!
id_id: Pertama-tama, terima kasih karena telah meluangkan waktu anda untuk berkontribusi!

source: Please note that only questions on the framework will be answered here. For issue related with any module, please contact their respective authors or post in their corresponding repositories.
id_id: Perlu diperhatikan bahwa hanya pertanyaan tentang kerangka kerja yang akan dijawab di sini. Untuk masalah yang berhubungan dengan setiap modul, silahkan menghubungi pengarang atau pos mereka masing-masing di repositori mereka yang sesuai.

source: Here is a simple guide on how you can file in an issue, or submit a pull request that is useful and effective.
id_id: Inilah panduan sederhana tentang bagaimana anda dapat mengajukan suatu masalah, atau mengajukan pull request yang berguna dan efektif.

source: If you need help, or want to talk to the authors, feel free to chat with us at our `Gitter chat`_ or `Telegram support group`_.
id_id: Jika anda membutuhkan bantuan, atau ingin berbicara dengan pengarang, jangan ragu untuk mengobrol dengan kami di `Gitter chat`_ atau`grup dukungan Telegram kami`_.

source: Reporting bugs
id_id: Melaporkan bug

source: Before submitting a bug report
id_id: Sebelum mengajukan laporan bug

source: Please ensure if your issue is about the framework itself, not about any module. Reports about module should be sent to their respective places.
id_id: Harap pastikan apabila masalah anda mengenai kerangka kerja itu sendiri, bukan mengenai setiap modul. Laporan mengenai modul harus dikirimkan ke tempat masing-masing.

source: Read through the documentation to see if it has covered your question.
id_id: Baca melalui dokumentasi untuk mengetahui jika itu telah mencakup pertanyaan anda.

source: Check the `current issue list`__ to see if it's been reported.
id_id: Periksa daftar `masalah baru-baru ini`__ untuk mengetahui jika telah dilaporkan.

source: How Do I Submit A (Good) Bug Report?
id_id: Bagaimana saya mengajukan laporan bug yang (baik)?

source: **Use a clear and descriptive title** for the issue to identify the problem.
id_id: **Gunakan judul yang jelas dan deskriptif** untuk masalah tersebut untuk mengidentifikasi masalah.

source: **Describe the exact steps which reproduce the problem** in as many details as possible.
id_id: **Deskripsikan langkah-langkah yang tepat yang mereproduksi masalah** dalam rincian sebanyak mungkin.

source: **Provide specific examples to demonstrate the steps.**
id_id: **Berikan contoh yang spesifik untuk menunjukkan langkah-langkahnya.**

source: **Describe the behavior you observed after following the steps** and point out what exactly is the problem with that behavior.
id_id: **Deskripsikan perilaku yang telah anda amati setelah mengikuti langkah-langkah tersebut** dan tunjukkan masalah apa sebenarnya dengan perilaku itu.

source: **Explain which behavior you expected to see instead and why.**
id_id: **Deskripsikan perilaku mana yang ingin anda ketahui dan mengapa.**

source: **If the problem wasn't triggered by a specific action**, describe what you were doing before the problem happened and share more information using the guidelines below.
id_id: **Jika masalah tersebut tidak dicetus oleh tindakan tertentu**, deskripsikan apa yang anda lakukan sebelum masalah itu terjadi dan bagikan informasi lebih banyak dengan menggunakan panduan di bawah ini.

source: **Provide log related to the issue.** Use the verbose flag to start the logging process, and submit the entire log from the first step you performed.
id_id: **Berikan log yang terkait dengan masalah ini.** Gunakan bendera verbose untuk memulai proses masuk, dan ajukan seluruh log dari langkah pertama yang anda lakukan.

source: Provide more context by answering these questions:
id_id: Berikan konteks lebih banyak dengan menjawab pertanyaan-pertanyaan ini:

source: **Did the problem start happening recently** (e.g. after updating to the latest version) or was this always a problem?
id_id: **Apakah masalah tersebut mulai terjadi baru-baru ini** (misalnya setelah memperbarui ke versi terbaru) atau apakah ini selalu menjadi masalah?

source: **Can you reliably reproduce the issue?** If not, provide details about how often the problem happens and under which conditions it normally happens.
id_id: **Bisakah anda dapat dipercaya mereproduksi masalah ini?** Jika tidak, berikan rincian tentang seberapa sering masalah tersebut terjadi dan dalam kondisi mana biasanya itu terjadi.

source: Include details about your configuration and environment:
id_id: Masukkan rincian tentang konfigurasi dan lingkungan anda:

source: **What version of EFB are you using?** You can get the version by using the flag `-V`.
id_id: **Versi EFB apa yang anda gunakan?** Anda bisa mendapatkan versi tersebut dengan menggunakan flag `-V`.

source: **What's the name and version of the OS you're using?**
id_id: **Apakah nama dan versi OS yang anda gunakan?**

source: When submitting your log, please remember to hide your private information.
id_id: Saat mengajukan log anda, harap ingat untuk menyembunyikan informasi pribadi anda.

source: Suggesting enhancements
id_id: Menyarankan perbaikan

source: If you have any suggestions, feel free to raise it up in the issue list. Please try to provide as much details as you can, that includes:
id_id: Jika anda memiliki saran, jangan ragu untuk mengajukannya dalam daftar masalah. harap coba untuk memberikan rincian sebanyak mungkin yang anda bisa, yang mana termasuk:

source: **Use a clear and descriptive title** for the issue to identify the suggestion.
id_id: ** Gunakan judul yang jelas dan deskriptif ** untuk masalah ini untuk mengidentifikasi sarannya.

source: **Give details on how the enhancement behave**.
id_id: **Berikan rincian tentang bagaimana perbaikan berperilaku**.

source: **Specify the name and version of the OS you're using.**
id_id: **Tentukan nama dan versi OS yang anda gunakan**

source: Adapted from `Atom contribution guide`__ by GitHub Inc.
id_id: Diadaptasi dari 'Panduan kontribusi Atom`__ oleh GitHub Inc.

source: Pull requests
id_id: Tarik permintaan

source: When you have done some changes and want to submit it to us, fork it to your account and submit a GitHub pull request. Please write a detailed description for your pull request on:
id_id: Saat anda sudah melakukan beberapa perubahan dan ingin mengajukannya kepada kami, salin itu ke akun anda dan ajukan pull request Github. harap tulis deskripsi yang terperinci untuk pull request anda pada:

source: **What changes have you made?**
id_id: **Perubahan apa yang sudah anda lakukan?**

source: **What problem have you solved?**
id_id: **Masalah apa yang sudah anda selesaikan?**

source: **Which issue have you addressed** if applicable.
id_id: **Masalah yang mana yang anda tujukan** jika berlaku.

source: Always write a clear log message for your commits. One-line messages are fine for small changes, but bigger changes needs a detailed description after the one-liner.
id_id: Selalu tulis pesan log yang jelas untuk komit anda. Pesan satu baris baik untuk perubahan kecil, namun perubahan yang lebih besar memerlukan penjelasan rinci setelah satu baris.
