Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/getting-started.po
Languages: id_id

source: Getting started
id_id: Mulai

source: A few simple steps to get started with EFB.
id_id: Beberapa langkah sederhana untuk memulai dengan EFB.

source: Install EH Forwarder Bot
id_id: Pasang EH Forwarder Bot

source: EH Forwarder Bot can be installed in the following ways:
id_id: EH Forwarder Bot dapat dipasang dengan cara berikut:

source: The following instructions may not work properly until a stable release is uploaded. As you are in the beta version documentation, I assume you know what to do.
id_id: Petunjuk berikut mungkin tidak bekerja sebagaimana mestinya hingga rilis stabil di unggah. Saat anda berada dalam dokumentasi versi beta, Saya berasumsi anda mengetahui apa yang harus dilakukan.

source: Install from PyPI
id_id: Pasang dari PyPI

source: ``pip`` will by default install the latest stable version from PyPI, but development versions are available at PyPI as well.
id_id: `` pip`` secara default akan memasang versi stabil terbaru dari PyPI, namun versi pengembangannya tersedia di PyPI juga.

source: Install from GitHub
id_id: Pasang dari GitHub

source: This will install the latest commit from GitHub. It might not be stable, so proceed with caution.
id_id: Ini akan memasang komit terbaru dari GitHub. Kemungkinan tidak stabil, jadi lanjutkan dengan hati-hati.

source: A good network environment
id_id: Lingkungan jaringan yang bagus

source: Since most of our channels are using polling for message retrieval, a good network environment is necessary for channels to run smoothly. A poor network environment may lead to slow response, or loss of messages.
id_id: Karena sebagian besar dari saluran kami menggunakan pemungutan suara untuk pengambilan pesan, baik lingkungan jaringan yang diperlukan untuk saluran dapat berjalan dengan lancar. Sebuah lingkungan jaringan yang buruk dapat menyebabkan respons yang lambat, atau kehilangan pesan.

source: Create local directories
id_id: Buat direktori lokal

source: EFB uses a \*nix user configuration style, which is described in details in :doc:`directories`. In short, if you are using the default configuration, you need to create ``~/.ehforwarderbot``, and give read and write permission to the user running EFB.
id_id: EFB menggunakan \*nix pengguna konfigurasi gaya, yang dijelaskan secara detail di :doc:`directories`. Singkatnya, jika anda menggunakan konfigurasi default, anda perlu membuat ``~/.ehforwarderbot``, dan memberikan membaca dan izin menulis untuk pengguna yang menjalankan EFB.

source: Choose, install and enable modules
id_id: Pilih, pasang dan aktifkan modul

source: Currently, all modules that was submitted to us are recorded in the `channels repository <https://github.com/blueset/ehForwarderBot/wiki/Channels-Repository>`_. You can choose the channels that fits your need the best.
id_id: Saat ini, semua modul yang dikirimkan kepada kami dicatat di `saluran repositori <https://github.com/blueset/ehForwarderBot/wiki/Channels-Repository>` _. Anda bisa memilih saluran yang terbaik yang sesuai dengan kebutuhan anda.

source: Instructions about installing each channel is available at their respective documentations.
id_id: Petunjuk tentang pemasangan setiap saluran tersedia di dokumentasi mereka masing-masing.

source: When you have successfully installed a channel, you can enable it by listing its Channel ID in the :doc:`configuration file <config>`. The default path is ``~/.ehforwarderbot/profiles/default/config.yaml``. Please refer to :doc:`directories` if you have configured otherwise.
id_id: Saat anda telah berhasil memasang saluran, anda bisa mengaktifkannya dengan mencantumkan ID Saluran di :doc:`berkas konfigurasi <config>`. Path bawaannya adalah ``~/.ehforwarderbot/profiles/default/config.yaml``. Silahkan merujuk pada :doc:`direktori` apabila anda sudah dikonfigurasikan sebaliknya.

source: Please note that although you can have more than one slaves channels running at the same time, you can only have exactly one master channels running in one profile. Meanwhile, middlewares are completely optional.
id_id: Harap dicatat bahwa meskipun anda dapat memiliki lebih dari satu saluran budak yang berjalan pada saat yang sama, anda hanya dapat memiliki satu saluran utama yang berjalan dalam satu profil. Sementara itu, middlewares benar-benar opsional.

source: Example
id_id: Contoh

source: Master channel
id_id: Saluran utama

source: Slave channels
id_id: Saluran Slave

source: In the ``config.yaml`` it should have the following lines:
id_id: Di '' config.yaml'' seharusnya baris berikut:

source: Launch EFB
id_id: Luncurkan EFB

source: This will launch EFB directly in the current environment. The default :doc:`profile` is named ``default``, to launch EFB in a different profile, append ``--profile <profile-name>`` to the command.
id_id: Ini akan meluncurkan EFB langsung dalam lingkungan saat ini. Default :doc:'profil' yang bernama '' default'', untuk memulai EFB di profil yang berbeda, menambahkan ''--profil <profile-name>'' ke perintah.

source: For more command line options, use ``--help`` option.
id_id: Untuk opsi baris perintah yang lain, menggunakan ''--membantu '' pilihan.

source: Launch EFB as a daemon process
id_id: Meluncurkan EFB sebagai proses daemon

source: Since version 2, EH Forwarder Bot has removed the daemon helper as it is unstable to use. We recommend you to use mature solutions for daemon management, such as systemd_, upstart_, or pm2_.
id_id: Semenjak versi 2, EH Forwarder Bot telah menghapus daemon helper karena tidak stabil penggunaannya. Kami menyarankan anda untuk menggunakan solusi yang baik untuk pengelolaan daemon, seperti systemd_, upstart_, atau pm2_.
