Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/channel.po
Languages: az_az, id_id, tr_tr

source: The abstract channel class.
az_az: Mücərrəd kanal sinifi.
id_id: Kelas saluran abstrak.
tr_tr: Soyut kanal sınıfı.

source: *str* -- A human-friendly name of the channel.
id_id: *str* -- Nama saluran seorang manusia-ramah.

source: *str* -- Emoji icon of the channel. Recommended to use a visually-length-one emoji that represents the channel best.
id_id: *str* -- Ikon Emoji dari saluran. Direkomendasikan untuk menggunakan emoji visual-length-one yang mewakili saluran dengan sebaik-baiknya.

source: :obj:`.ChannelType` -- Type of the channel.
id_id: :obj:`.ChannelType` -- Tipe saluran.

source: Set[:obj:`.MsgType`] -- Types of messages that the channel accepts as incoming messages.
id_id: Atur[:obj:`.MsgType`] --Jenis pesan yang diterima saluran sebagai pesan masuk.

source: *str* -- Unique identifier of the channel. Convention of IDs is specified in :doc:`/guide/packaging`. This ID will be appended with its instance ID when available.
id_id: *str* -- mengenal yang Unik dari saluran. Konvensi Id ditetapkan di :doc:`/panduan/kemasan`. ID ini akan ditambahkan dengan contoh ID bila tersedia.

source: Initialize the channel. Inherited initializer must call the "super init" method at the beginning.
az_az: Kanalın başladılması. Inherited başladılması "super init" üsulunu ilə çağırılmalıdır.
id_id: Menginisialisasi saluran. Mewarisi penginisialisasi harus memanggil "super init" di metode awal.
tr_tr: Kanalı başlat. Devralınan başlatıcı başlangıçta "süper init" yöntemini çağırmalıdır.

source: Parameters
az_az: Tənzimləmələr
id_id: Parameter
tr_tr: Parametreler

source: Get the chat object from a slave channel.
az_az: Çat obyektini ana kanaldan əldə et.
id_id: Dapatkan objek obrolan dari saluran budak.
tr_tr: Sohbet nesnesini slave kanalından alın.

source: UID of the chat.
az_az: Çatın UID-i.
id_id: UID dari obrolan.
tr_tr: Sohbetin benzersiz kimliği.

source: UID of group member, only when the selected chat is a group.
az_az: Qrup üzvlərinin UİD-si, sadəcə seçilmiş çat qrupları.
id_id: UID anggota grup, hanya saat obrolan yang dipilih merupakan sebuah grup.
tr_tr: Grup üyesinin benzersiz kimliği, yalnızca seçilen sohbet bir grup olduğunda geçerlidir.

source: Returns
az_az: Qaytarmalar
id_id: Kembali
tr_tr: Dönüşler

source: The chat found.
az_az: Çat tapıldı.
id_id: Obrolan ditemukan.
tr_tr: Sohbet bulundu.

source: Return type
az_az: Qaytarma növü
id_id: Jenis pengembalian
tr_tr: Dönüş türü

source: raises
id_id: meningkatkan
tr_tr: yükselişler

source: :exc:`~.exceptions.EFBChatNotFound` -- Raised when a chat required is not found.
id_id: :exc:`~.exceptions.EFBChatNotFound` -- Meningkatkan saat obrolan yang diperlukan tidak ditemukan.
tr_tr: :exc:`~.exceptions.EFBChatNotFound` -- Gerekli bir sohbet bulunmadığında yükseltilir.

source: This is not required by Master Channels
az_az: Bu Usta Kanallarda vacib deyil
id_id: Ini tidak diperlukan oleh Saluran Inti
tr_tr: Bu Ana Kanallar için gerekli değildir

source: Get the profile picture of a chat. Profile picture is also referred as profile photo, avatar, "head image" sometimes.
az_az: Çatın profil şəklini əldə et. Profil şəkli, bəzən profil fotosuna, avatara, "başlıq şəkli" istinad olunur.
id_id: Dapatkan gambar profil dari sebuah obrolan. Gambar profil juga disebut sebagai foto profil, avatar, "kepala gambar" kadang-kadang.
tr_tr: Bir sohbetin profil resmini alın. Profil resmi aynı zamanda profil fotoğrafı, avatar, bazen "baş resim" olarak adlandırılır.

source: Chat to get picture from.
az_az: Çatdan profil şəkli əldə et.
id_id: Obrolan untuk mendapatkan gambar.
tr_tr: Resim almak için sohbet edin.

source: Opened temporary file object. The file object must have appropriate extension name that matches to the format of picture sent, and seek to position 0. It can be deleted when closed if not required otherwise.
az_az: Müvəqqəti fayl obyekti açıldı. Fayl obyektində göndərilən şəkil formatına uyğun olan müvafiq fayl sonluğu olmalıdır və 0-ə yerləşdirilməlidir. Əks halda istənilən bağlı vəziyyətlərdə silinə bilər.
id_id: Terbuka sementara berkas objek. Berkas objek harus memiliki nama ekstensi yang sesuai supaya cocok dengan format gambar yang dikirim, dan mencari posisi 0. Itu dapat terhapus ketika ditutup jika tidak diperlukan sebaliknya.
tr_tr: Geçici dosya nesnesi açıldı. Dosya nesnesi gönderilen resim biçimiyle eşleşen uygun uzantı adına sahip olmalıdır, ve 0 pozisyonunu bulmaya çalış. Kapatılıp ihtiyaç duyulmadığı takdirde silinebilir.

source: Opened temporary file object. The file object must have appropriate extension name that matches to the format of picture sent, and seek to position 0.
az_az: Müvəqqəti fayl obyekti açıldı. Fayl obyektində göndərilən şəkil formatına uyğun olan müvafiq fayl sonluğu olmalıdır və 0-ə yerləşdirilməlidir.
id_id: Terbuka sementara berkas objek. Berkas objek harus memiliki nama ekstensi yang sesuai supaya cocok dengan format gambar yang dikirim, dan mencari posisi 0.
tr_tr: Geçici dosya nesnesi açıldı. Dosya nesnesi gönderilen resim biçimiyle eşleşen uygun uzantı adına sahip olmalıdır, ve 0 pozisyonunu bulmaya çalış.

source: It can be deleted when closed if not required otherwise.
az_az: Əks halda istənilən bağlı vəziyyətlərdə silinə bilər.
id_id: Itu dapat terhapus ketika ditutup jika tidak diperlukan sebaliknya.
tr_tr: Kapatılıp ihtiyaç duyulmadığı takdirde silinebilir.

source: :exc:`~.exceptions.EFBOperationNotSupported` -- Raised when the chat does not offer a profile picture.
id_id: :exc:`~.exceptions.EFBOperationNotSupported` -- Meningkatkan saat obrolan tidak menganjurkan gambar profil.
tr_tr: :exc:`~.exceptions.EFBOperationNotSupported` -- Sohbet bir profil resmi sunmadığında yükseltilir.

source: Examples
az_az: Nümunələr
id_id: Contoh
tr_tr: Örnekler

source: Return a list of available chats in the channel.
az_az: Kanalda olan mümkün çat siyahısına qayıdın.
id_id: Mengembalikan sebuah daftar obrolan yang tersedia di saluran.
tr_tr: Kanalın içerisindeki kullanılabilir sohbetlerin listesine geri dön.

source: a list of available chats in the channel.
az_az: kanalda mümkün olan çatların siyahısı.
id_id: sebuah daftar dari obrolan yang tersedia di saluran.
tr_tr: kanalın içerisindeki kullanılabilir sohbetlerin listesi.

source: Get a list of additional features
az_az: Əlavə xüsusiyyətlərin siyahısını əldə et
id_id: Mendapatkan sebuah daftar fitur tambahan
tr_tr: Ek özelliklerin bir listesini alın

source: A dict of methods marked as additional features. Method can be called with ``get_extra_functions()["methodName"]()``.
az_az: Üsulların bir nümunəsi əlavə xüsusiyyət kimi qeyd olunmuşdur. Üsul ilə çağrılacaq ``get_extra_functions()["methodName"]()``.
id_id: Sebuah contoh metode yang ditandai sebagai fitur tambahan. Metode yang dapat disebut dengan``get_extra_functions()["methodName"]()``.
tr_tr: Ek özellikler olarak işaretlenmiş metotların bir sözlüğü. Yöntem, ``get_extra_functions()["methodName"]()`` ile çağrılabilir.

source: Method to poll for messages. This method is called when the framework is initialized. This method should be blocking.
az_az: Mesajlar üçün anket üsulu. Bu üsul framework çağırışını başladır. Bu üsulun qarşısı alınmalıdır.
id_id: Metode untuk pemungutan suara untuk pesan. Metode ini disebut saat diinisialisasi kerangka kerja. Metode ini harus memblokir.
tr_tr: Mesajları sorgulamak için yöntem. Bu yöntem altyapısı başlatıldığında çağrılır. Bu yöntem bloke edilmeli.

source: Send a message to, or edit a sent message in the channel.
az_az: Mesaj göndər və ya bu kanlada göndərilən mesajı redaktə et.
id_id: Mengirim pesan ke, atau mengubah pesan terkirim di saluran.
tr_tr: Kanal içerisinde bir mesaj gönderin veya gönderilen bir mesajı düzenleyin.

source: Message object to be processed.
az_az: Mesaj obyekti emal olunur.
id_id: Objek pesan akan diproses.
tr_tr: İşlenecek mesaj nesnesi.

source: The same message object with message ID from the recipient.
az_az: Alıcının mesaj İD ilə mesaj obyekti eynilik təşkil edir.
id_id: Objek pesan yang sama dengan ID pesan dari penenerima.
tr_tr: Alıcının mesaj kimliği ile aynı mesaj nesnesi.

source: :exc:`~.exceptions.EFBMessageTypeNotSupported` -- Raised when the message type sent is not supported by the channel.
id_id: :exc:`~.exceptions.EFBMessageTypeNotSupported` -- Meningkatkan saat jenis pesan yang dikirim tidak didukung oleh saluran.
tr_tr: :exc:`~.exceptions.EFBMessageTypeNotSupported` -- Gönderilen mesaj türü kanal tarafından desteklenmediğinde yükseltilir.

source: :exc:`~.exceptions.EFBOperationNotSupported` -- Raised when an message edit request is sent, but not supported by the channel.
id_id: :exc:`~.exceptions.EFBOperationNotSupported` -- Meningkatkan saat permintaan edit pesan dikirim, namun tidak didukung oleh saluran.
tr_tr: :exc:`~.exceptions.EFBOperationNotSupported` -- Bir mesaj düzenleme isteği gönderildiğinde ve bu istek kanal tarafından desteklenmiyor ise yükseltilir.

source: :exc:`~.exceptions.EFBMessageNotFound` -- Raised when an existing message indicated is not found. E.g.: The message to be edited, the message referred in the :attr:`msg.target <.EFBMsg.target>` attribute.
id_id: :exc:`~.exceptions.EFBMessageNotFound` -- Meningkatkan saat pesan yang ditunjukkan tidak ditemukan. Misalnya: Pesan yang akan diedit, pesan yang ditunjukkan dalam :attr:`msg.target <.EFBMsg.target>` atribut.
tr_tr: :exc:`~.exceptions.EFBMessageNotFound` -- Belirtilen mevcut mesaj bulunamadığında yükseltilir. Örnek olarak: Mesaj düzeltilecektir, :attr:`msg.target <.EFBMsg.target>` nitelikte bahsedilen mesaj.

source: :exc:`~.exceptions.EFBMessageError` -- Raised when other error occurred while sending or editing the message.
id_id: :exc:`~.exceptions.EFBMessageError` -- Meningkatkan saat terjadinya kesalahan lain saat mengirim atau mengedit pesan.
tr_tr: :exc:`~.exceptions.EFBMessageError` -- Mesaj gönderirken veya düzenlerken başka bir hata meydana geldiğinde yükseltilir.

source: Send a status to the channel.
az_az: Kanala status göndər.
id_id: Kirim sebuah status ke saluran.
tr_tr: Kanala bir durum gönderin.

source: :exc:`~.exceptions.EFBMessageNotFound` -- Raised when an existing message indicated is not found. E.g.: The message to be removed.
id_id: :exc:`~.exceptions.EFBMessageNotFound` -- Meningkatkan saat pesan yang ditunjukkan tidak ditemukan. Misalnya: Pesan yang akan dihapus.
tr_tr: :exc:`~.exceptions.EFBMessageNotFound` -- Belirtilen mevcut mesaj bulunamadığında yükseltilir. Örnek olarak: Kaldırılıcak olan mesaj.

source: :exc:`~.exceptions.EFBOperationNotSupported` -- Raised when the channel does not support message removal.
id_id: :exc:`~.exceptions.EFBOperationNotSupported` -- Meningkatkan saat saluran tidak mendukung penghapusan pesan.
tr_tr: :exc:`~.exceptions.EFBOperationNotSupported` -- Kanal mesajı kaldırmayı desteklemediğinde yükseltilir.

source: :exc:`~.exceptions.EFBMessageError` -- Raised when other error occurred while removing the message.
id_id: :exc:`~.exceptions.EFBMessageError` -- Dibesarkan ketika terjadinya kesalahan saat menghapus pesan.
tr_tr: :exc:`~.exceptions.EFBMessageError` -- Mesajı silerken başka bir hata meydana geldiğinde yükseltilir.

source: Avoid raising exceptions from this method in Master Channels as it would be hard for a Slave Channel to process the exception.
id_id: Hindari meningkatkan pengecualian dari metode ini di Saluran Inti karena itu akan sulit bagi sebuah Saluran Budak untuk memproses pengecualian tersebut.
tr_tr: Ana Kanallarda bu yöntem ile kural dışı yükseltmelerden kaçının çünkü Bağımlı Kanalın kural dışı durumları işlemesi oldukça zordur.

source: This is not applicable to Slave Channels
az_az: Bu Usta Kanallara tətbiq oluna bilməz
id_id: Ini tidak berlaku untuk Saluran Budak
tr_tr: Bu Bağımlı Kanallar için uygulanabilir değildir

source: When EFB framework is asked to stop gracefully, this method is called to each channel object to stop all processes in the channel, save all status if necessary, and terminate polling.
az_az: EFB framework nə vaxtsa bu üsulu çağırarsa, kanal daxilində olan bütün proseslər dayandırılacaq, bütün statuslar saxlanacaq və səs vermələr ləğv olunacaqdır.
id_id: Bila kerangka kerja EFB diminta untuk berhenti dengan anggun, metode ini dipanggil ke setiap objek saluran untuk menghentikan semua proses di saluran, menyimpan semua status jika diperlukan, dan mengakhiri pemungutan suara.
tr_tr: EFB altyapısı düzgün bir şekilde durdurulması istenildiğinde, bu yöntem kanal içerisindeki tüm işlemleri durdurmak için bütün kanal nesnelerine çağrılır, gerekirse tüm durumu kaydedin ve yoklamayı sonlandırın.

source: When the channel is ready to stop, the polling function must stop blocking. EFB framework will quit completely when all polling threads end.
az_az: Kanal dayandırılmağa hazır olduqda, səs vermə funksiyası blokuda dayandırmalıdır. EFB framework tamamilə bütün səs vermələrdən çıxacaqdır.
id_id: Saat saluran siap untuk berhenti, fungsi pemungutan suara harus berhenti mencekal. Kerangka kerja EFB akan berhenti sepenuhnya di saat semua rangkaian pemungutan suara berakhir.
tr_tr: Kanal durmaya hazır olduğunda, yoklama fonksiyonu engelleme işlemini durdurmalıdır. EFB altyapısı bütün iş parçacıklarının yoklaması bittiğinde tamamen sona ericektir.

source: Common operations
az_az: Ümumi əməliyyatlar
id_id: Operasi umum
tr_tr: Ortak işlemler

source: Sending messages and statuses
az_az: Mesajların və statusların göndərilməsi
id_id: Mengirim pesan dan status
tr_tr: Mesajlar ve durumlar gönderiliyor

source: Sending messages and statuses to other channels is the most common operation of a channel. When the channel has gathered enough information from external sources, it should be further processed and packed into the relative objects, i.e. :obj:`.EFBMsg` and :obj:`.EFBStatus`.
az_az: Mesajları və statusları digər kanallara göndərmək kanalın ümumi əməliyyatıdır. Kanal xarici mənbələrdən kifayət qədər məlumatlar topladıqda, onu daha da emal edir və nisbi obyektlərə qablaşdırır. məs. :obj:`.EFBMsg` and :obj:`.EFBStatus`.
id_id: Mengirim pesan dan status ke saluran lain adalah operasi saluran yang paling umum. Saat saluran telah mengumpulkan cukup informasi dari sumber eksternal, maka sebaiknya diproses lebih lanjut dan dimasukkan ke objek relatif, yaitu :obj: `.EFBMsg` dan :obj:`.EFBStatus`.
tr_tr: Mesajların ve durumların başka bir kanala gönderilmesi bir kanalın en yaygın işlemidir. Kanal dış kaynaklardan yeteri kadar bilgiyi topladığında, daha fazla işlemeli ve ilgili nesnelere paketlenmelidir, yani :obj:`.EFBMsg` ve :obj:`.EFBStatus`.

source: When the related information is packed into their relative objects, it can be sent to the coordinator for the next step.
az_az: Müvafiq məlumatlar onların nisbi obyektlərinə daxil olduqda, növbəti addımda onları koordinatora göndərmək lazımdır.
id_id: Ketika informasi yang terkait dikemas ke dalam objek relatif mereka, itu dapat dikirim kepada koordinator untuk langkah selanjutnya.
tr_tr: İlgili bilgiler bağlı olduğu nesnelere paketlendiğinde, bir sonraki adım için koordinatöre gönderilebilir olucaktır.

source: For now, both :obj:`.EFBMsg` and :obj:`.EFBStatus` has an attribute that indicates that where this object should be delivered to (:attr:`.EFBMsg.deliver_to` and :attr:`.EFBStatus.destination_channel`). This is used by the coordinator when delivering the message.
az_az: İndi, hər ikisi :obj:`.EFBMsg`və :obj:`.EFBStatus` obyektin çatdırılması lazım olan bir göstəriciyə sahibdir (:attr:`.EFBMsg.deliver_to` and :attr:`.EFBStatus.destination_channel`). Mesaj çatdırarkən koordinatordan istifadə olunur.
id_id: Untuk saat ini, kedua :obj:`.EFBMsg` dan :obj:`.EFBStatus` memiliki sebuah atribut yang menunjukkan bahwa dimana objek ini harus sampaikan ke (:attr:`.EFBMsg.deliver_to` dan :attr:`.EFBStatus.destination_channel`). Ini digunakan oleh koordinator ketika menyampaikan pesan tersebut.
tr_tr: Şimdilik, hem :obj:`.EFBMsg` hem de :obj:`.EFBStatus` için nereye teslim edileceğini gösteren bir niteliğe sahiptir (:attr:`.EFBMsg.deliver_to` ve :attr:`.EFBStatus.destination_channel`). Bu mesaj teslim edilirken koordinatör tarafından kullanılır.

source: For messages, it can be delivered with :meth:`.coordinator.send_message`, and statuses can be delivered with :meth:`.coordinator.send_status`.
az_az: Mesajlar üçün, onunla çatdırılır :meth:`.coordinator.send_message`, və statuslar onunla çatdırılır :meth:`.coordinator.send_status`.
id_id: Untuk pesan, dapat dikirim bersama :meth:`.coordinator.send_message`, dan status dapat dikirim dengan :meth:`.coordinator.send_status`.
tr_tr: Mesajlar için, :meth:`.coordinator.send_message` ile teslim edilebilir, ve durumlar için şu yöntem ile :meth:`.coordinator.send_status` teslim edilebilir.

source: When the object is passed onto the coordinator, it will be further processed by the middleware.
az_az: Nəzarət koordinatorun üzərinə ötürüldükdə, əlavə proqram tərəfindən işlənəcəkdir.
id_id: Saat objek dilewatkan ke koordinator, maka akan diproses lebih lanjut oleh middleware.
tr_tr: Nesne koordinatöre devredildiğinde, aracı yazılım tarafından ayrıca işlenilecektir.

source: About Channel ID
az_az: Kanal İD-i haqqında
id_id: Tentang ID Saluran
tr_tr: Kanal Kimliği Hakkında

source: With the introduction of instance IDs, it is required to use the ``self.channel_id`` or equivalent instead of any hard-coded ID or constants while referring to the channel (e.g. while retrieving the path to the configuration files, creating chat and message objects, etc).
az_az: İnstansiya İD üçün istifadə etmək tələb olunur ``self.channel_id``və ya kanala istinad edərkən hər hansı bir sabit kodlu İD və ya sabitlərin əvəzinə ekvivalent tətbiq olunur (məs. konfiqurasiya fayllarına gedən yolun əldə olunması, çat və mesaj obyektlərinin yaradılması və s.).
id_id: Dengan diperkenalkannya contoh ID, diperlukan untuk menggunakan ``self.channel_id`` atau setara dengan ID kode keras atau konstanta saat mengacu pada peranti tengah (misalnya saat mengambil jalur pada berkas konfigurasi, membuat objek obrolan dan pesan, dll).
tr_tr: Örnek kimliklerin sunulmasıyla birlikte, kanala atıfta bulunulurken sabit kodlanmış kimlik veya sabitler yerine ``self.channel_id`` veya eşdeğeri kullanmak gerekir (örn. Yapılandırma dosyalarına yol açarken sohbet oluştururken ve mesaj nesneleri vb.).

source: Instance ID of the channel.
az_az: Kanalın instansiya İD-i.
tr_tr: Kanalın örnek kimliğidir.

source: the status
az_az: statusu
tr_tr: durum

source: EFBChannel
az_az: EFBKanal
