Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/chat.po
Languages: es_ve, id_id, tr_tr

source: EFB Chat object. This is used to represent a chat or a group member.
es_ve: Objeto EFB chat. Es usado para representar un chat o a un miembro de grupo.
id_id: Objek Obrolan EFB Ini digunakan untuk mewakili obrolan atau anggota grup.
tr_tr: EFB Sohbet nesnesi. Bir sohbeti veya bir grup üyesini temsil etmesi için kullanılır.

source: *str* -- Unique ID of the channel.
es_ve: *str* -- Identificador único del canal.
id_id: * str *--ID unik saluran.
tr_tr: *str* -- Kanalın eşsiz kimliği.

source: *str* -- Emoji of the channel.
es_ve: *str* -- Emoticón del canal.
id_id: * str *--Id pada saluran.
tr_tr: *str* -- Kanalın emojisi.

source: *str* -- Name of the channel.
es_ve: *str* -- Nombre del canal.
id_id: *str* -- Nama pada saluran.
tr_tr: *str* -- Kanalın adı.

source: *str* -- Name of the chat.
es_ve: *str* -- Nombre del chat.
id_id: *str* -- Name pada obrolan.
tr_tr: *str* -- Sohbetin adı.

source: *str* -- Alternative name of the chat, usually set by user.
es_ve: *str* -- Nombre alternativo del chat, usualmente establecido por el usuario.
id_id: *str* - - Nama alternatif obrolan, biasanya ditetapkan oleh pengguna.
tr_tr: *str* -- Sohbetin alternatif adı, genellikle kullanıcı belirler.

source: :obj:`.ChatType` -- Type of the chat.
es_ve: :obj:`.ChatType` -- Tipo de chat.
id_id: :obj:`.ChatType` -- Jenis obrolan.
tr_tr: :obj:`.ChatType` -- Sohbetin türü.

source: *str* -- Unique ID of the chat. This should be unique within the channel.
es_ve: *str* -- Identificador único del chat. Este debe ser único dentro del canal.
id_id: *str* -- ID unik obrolan. Ini seharusnya unik di dalam saluran.
tr_tr: *str* -- Sohbetin eşsiz kimliği. Kanal içerisinde benzeri bulunmamalıdır.

source: *bool* -- Indicate if this object represents a chat. Defaulted to ``True``. This should be set to ``False`` when used on a group member.
es_ve: *bool* -- Indica si este objeto representa un chat. Configurado como ``True`` por defecto. Debe ser configurado como ``False`` cuando es usado como un miembro de grupo.
id_id: *bool* -- Menunjukkan jika objek ini mewakili sebuah obrolan. Defaultkan ke ``Benar``. Ini seharusnya diatur ke ``Salah`` saat digunakan pada sebuah anggota grup.
tr_tr: *bool* -- Eğer bu nesne bir sohbeti temsil ediyorsa belirtir. Varsayılan olarak ``True``. Bir grup üyesi tarafından kullanıldığında ``False`` olarak ayarlanmalıdır.

source: :obj:`.EFBChat` or None -- The parent chat of the member. Only available to chat member objects. Defaulted to ``None``.
es_ve: :obj:`.EFBChat` or None -- El chat padre del miembro de grupo. Solo disponible para objetos member chats. Esta configurado por defecto a ``None``.
id_id: :obj:`.EFBChat` atau Tidak -- obrolan induk dari anggota. Hanya tersedia untuk objek obrolan anggota. Gagal ke ``Tidak ada``.
tr_tr: :obj:`.EFBChat` or None -- Üyenin üst sohbeti. Yalnızca sohbet üye nesneleri için geçerlidir. Varsayılan olarak ``None``.

source: list of :obj:`.EFBChat` -- Provide a list of members in the group. Defaulted to an empty ``list``. You may want to extend this object and implement a ``@property`` method set for loading members on demand.
id_id: daftar :obj:`.EFBChat` -- Memberikan daftar anggota dalam kelompok. Pengosongan gagal ``daftar``. Anda mungkin ingin memperluas objek dan menerapkan ``@properti`` metode yang ditetapkan untuk memuat anggota pada permintaan.

source: *Dict[str, Any]* -- Any vendor specific attributes.
es_ve: *Dict[str, Any]* -- Atributos específicos del proveedor.
id_id: *Dict[str, Any]* -- Setiap atribut tertentu vendor.
tr_tr: *Dict[str, Any]* -- Herhangi bir sağlayıcının özel nitelikleri.

source: *bool* -- Indicate if this chat represents the user.
es_ve: *bool* -- Indica si este chat representa a un usuario.
id_id: *bool* -- Menunjukkan jika obrolan ini mewakili pengguna.
tr_tr: *bool* -- Eğer bu sohbet bir kullanıcıyı temsil ediyor ise belirt.

source: *bool* -- Indicate if this chat represents a system chat/member.
es_ve: *bool* -- Indica si este chat representa un chat o miembro del sistema.
id_id: *bool* -- Menunjukkan jika obrolan ini merupakan sistem obrolan/anggota.
tr_tr: *bool* -- Eğer bu sohbet bir sistem sohbetini/üyesini temsil ediyor ise belirt.

source: Parameters
es_ve: Parámetros
id_id: Parameter
tr_tr: Parametreler

source: Provide the channel object to fill :attr:`channel_name`, :attr:`channel_emoji`, and :attr:`channel_id` automatically.
es_ve: Proporciona el objeto channel necesario para llenar los atributos :attr:`channel_name`, :attr:`channel_emoji`, y :attr:`channel_id` automáticamente.
id_id: Menyediakan objek saluran untuk diisi :attr:`channel_name`, :attr:`channel_emoji`, dan :attr:`channel_id` secara otomatis.
tr_tr: Otomatik olarak :attr:`channel_name`, :attr:`channel_emoji`, ve :attr:`channel_id` doldurmak için kanal nesnesini sağla.

source: If this chat represents the user
es_ve: Si este chat representa a un usuario
id_id: Jika obrolan ini mewakili pengguna
tr_tr: Eğer bu sohbet kullanıcıyı temsil ediyorlarsa

source: If this chat is a system chat
es_ve: Si este chat es un chat de sistema
id_id: Jika obrolan ini adalah sebuah sistem obrolan
tr_tr: Eğer bu sohbet bir sistem sohbeti ise

source: Set the chat as yourself. In this context, "yourself" means the user behind the master channel. Every channel should relate this to the corresponding target.
es_ve: Establece el chat como "yourself". En este contexto, "yourself" se refiere al usuario que esta detrás del canal maestro. Todos los canales deben relacionar esta opción con su destino correspondiente.
id_id: Atur obrolan seperti dirimu sendiri. Dalam konteks ini, "diri sendiri" berarti pengguna di balik saluran utama. Setiap saluran harus menghubungkan ini dengan target yang sesuai.
tr_tr: Sohbeti kendinizin olarak ayarlayın. Bu bağlamda, "kendinizin" anlamı ana kanalın arkasındaki kullanıcıdır. Her kanal bunu uygun hedef ile ilişkilendirmelidir.

source: Returns
es_ve: Retorno
id_id: Kembali
tr_tr: Dönüşler

source: This object.
es_ve: Este objeto.
id_id: Objek ini.
tr_tr: Bu nesne.

source: Return type
es_ve: Tipo de dato devuelto
id_id: Kembali ke jenis
tr_tr: Dönüş türü

source: Set the chat as a system chat. Only set for channel-level and group-level system chats.
es_ve: Establece el chat como un chat de sistema. Únicamente es definido para chats de sistema del tipo channel-level y group-level.
id_id: Mengatur obrolan sebagai sistem obrolan. Hanya ditetapkan untuk tingkat saluran dan tingkat grup sistim chatting.
tr_tr: Sohbeti bir sistem sohbeti olarak ayarla. Sadece kanal-seviyesi ve grup-seviyesi sistem sohbetleri için ayarlanabilir.

source: Verify the completeness of the data.
es_ve: Verifica la integridad de los datos.
id_id: Mengverifikasi kelengkapan data.
tr_tr: Verinin bütünlüğünü doğrula.

source: raises
es_ve: llamada de excepciones
id_id: meningkatkan
tr_tr: yükselişler

source: :exc:`ValueError` -- When this chat is invalid.
es_ve: :exc:`ValueError` --Es llamada esta excepción cuando el chat es inválido.
id_id: :exc:`ValueError` -- Saat obrolan ini tidak valid.
tr_tr: :exc:`ValueError` -- Bu sohbet geçersiz olduğunda.
