Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/constants.po
Languages: es_ve, id_id, ms_my, tr_tr

source: Constants
es_ve: Constantes
id_id: Konstan
ms_my: Malang
tr_tr: Sabitler

source: An enumeration.
es_ve: Una enumeración.
id_id: Sebuah enumerasi.
ms_my: Penghitungan.
tr_tr: Bir sayım.

source: Audio message. Including music and voice message.
es_ve: Mensajes de audio. Incluyendo música y mensajes de voz.
id_id: Pesan audio. Termasuk musik dan pesan suara.
ms_my: Mesej audio. Termasuk muzik dan mesej suara.
tr_tr: Sesli mesaj. Müzik ve ses mesajı içerir.

source: Messages sent as a file.
es_ve: Mensajes enviados como archivos.
id_id: Pesan dikirim sebagai sebuah file.
ms_my: Mesej dihantar sebagai fail.
tr_tr: Dosya olarak yollanmış mesajlar.

source: Image (picture) message
ms_my: Mesej gambar (gambar)
tr_tr: Görüntü (resim) mesajı

source: Message that is mainly one specific link, or a text message with one link preview.
es_ve: Mensajes que es básicamente un enlace a otro contenido, o un mensaje de texto con un "link preview".
id_id: Pesan yang terutama salah satu tautan tertentu, atau sebuah pesan teks dengan satu peninjauan tautan.
ms_my: Mesej yang terutamanya satu pautan tertentu, atau mesej teks dengan satu pratonton pautan.
tr_tr: Başlıca tek bir bağlantı içeren mesaj, veya bir bağlantı önizlemesi içeren metin mesajı.

source: Location message.
es_ve: Localización del mensaje.
id_id: Lokasi pesan.
ms_my: Mesej lokasi.
tr_tr: Konum mesajı.

source: Status from a user in a chat, usually typing and uploading.
es_ve: Estado de un usuario dentro de un chat, generalmente escribiendo y subiendo.
id_id: Status dari pengguna dalam obrolan, biasanya mengetik dan mengunggah.
ms_my: Status dari pengguna dalam sembang, biasanya menaip dan memuat naik.
tr_tr: Sohbetteki bir kullanıcının durumu, genellikle yazma ve yükleme.

source: Pictures sent with few text caption, usually a transparent background, and a limited number of options that is usually not from the user's photo gallery.
es_ve: Imágenes enviadas con unos pocos subtítulos de texto, usualmente con un fondo transparente, con un número limitado de opciones y la cual generalmente no pertenece a la galería de fotos del usuario.
id_id: Gambar dikirim dengan beberapa keterangan teks, biasanya berlatar belakang transparan, dan sejumlah pilihan yang terbatas yang biasanya bukan berasal dari galeri foto pengguna.
ms_my: Gambar yang dihantar dengan beberapa teks teks, biasanya latar belakang telus, dan beberapa pilihan terhad yang biasanya bukan dari galeri foto pengguna.
tr_tr: Birkaç metin yazısı ile gönderilmiş resim, genellikle şeffaf bir arkaplan, ve genellikle kullanıcının fotoğraf galerisinde bulunmayan sınırlı sayıda seçenekler.

source: Text message
es_ve: Mensaje de texto
id_id: Pesan teks
ms_my: Mesej teks
tr_tr: Metin mesajı

source: Any type of message that is not listed above. A text representation is required.
es_ve: Cualquier tipo de mensajes que no esta listado arriba. Una representación de texto es requerida.
id_id: Apa pun jenis pesan yang tidak tercantum di atas. Sebuah teks representasi diperlukan.
ms_my: Mana-mana jenis mesej yang tidak disenaraikan di atas. Perwakilan teks diperlukan.
tr_tr: Yukarıda listelenmeyen her tür mesaj. Metin gösterimi gereklidir.

source: Video message
es_ve: Mensaje de video
id_id: Pesan video
tr_tr: Video mesajı
