Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/coordinator.po
Languages: es_ve, id_id, ms_my, tr_tr

source: Coordinator
es_ve: Coordinador
id_id: Koordinator
ms_my: Penyelaras
tr_tr: Koordinatör

source: Coordinator among channels.
es_ve: Coordinador de los canales.
id_id: Koordinator antar saluran.
ms_my: Penyelaras di kalangan saluran.
tr_tr: Kanallar arası koordinatör.

source: *str* -- Name of current profile..
es_ve: *str* -- Nombre del perfil actual..
id_id: *str* -- Nama profil saat ini..
tr_tr: *str* -- Şuanki profilin adı..

source: *threading.Lock* -- Global interaction thread lock.
es_ve: *threading.Lock* -- Interacción global con el "thread lock".
id_id: *threading.Lock* -- Kunci untaian interaksi global.
tr_tr: *threading.Lock* -- Evrensel etkileşimli iş parçacığı kiliti.

source: *EFBChannel* -- The running master channel object.
es_ve: *EFBChannel* -- El objeto del canal maestro en ejecución.
id_id: *EFBChannel* -- Objek saluran utama yang sedang berjalan.
tr_tr: *EFBChannel* -- Çalışan ana kanal nesnesi.

source: *Dict[str, EFBChannel]* -- Dictionary of running slave channel object. Keys are the unique identifier of the channel.
tr_tr: *Dict[str, EFBChannel]* -- Köle kanal nesnesinin çalıştırılması sözlüğü. Tuşlar, kanalın benzersiz tanımlayıcısıdır.

source: *List[EFBMiddleware]* -- List of middlewares
es_ve: *List[EFBMiddleware]* -- Lista de middlewares
tr_tr: *List[EFBMiddleware]* -- Aracı yazılımların listesi

source: Register the channel with the coordinator.
es_ve: Registra el canal con el coordinador.
id_id: Daftar saluran dengan koordinator.
ms_my: Daftar saluran dengan penyelaras.
tr_tr: Kanalı koordinatör ile kaydet.

source: Parameters
es_ve: Parámetros
id_id: Parameter
tr_tr: Parametreler

source: Channel to register
es_ve: El canal a registrar
id_id: Saluran untuk mendaftar
ms_my: Saluran untuk mendaftar
tr_tr: Kaydedilecek kanal

source: Register a middleware with the coordinator.
es_ve: Registra un middleware con el coordinador.
id_id: Daftar sebuah peranti tengah dengan koordinator.
ms_my: Daftar middleware dengan penyelaras.
tr_tr: Aracı yazılımı bir koordinatör ile kaydettir.

source: Middleware to register
es_ve: El middleware a registrar
id_id: Peranti tengah untuk mendaftar
ms_my: Middleware untuk mendaftar
tr_tr: Kaydedilecek aracı yazılım

source: Deliver a message to the destination channel.
es_ve: Envía un mensaje al canal de destino.
id_id: Mengirimkan pesan ke saluran tujuan.
ms_my: Menyampaikan mesej ke saluran tujuan.
tr_tr: Hedef kanala bir mesaj gönderin.

source: The message
es_ve: El mensaje
id_id: Pesan
ms_my: Mesej itu
tr_tr: Mesaj

source: Returns
es_ve: Retorno
id_id: Kembali
ms_my: Pulangan
tr_tr: Dönüşler

source: The message sent by the destination channel, includes the updated message ID from there. Returns ``None`` if the message is not sent.
es_ve: El mensaje enviado por el canal de destino, incluye el ID del mensaje actualizado proveniente de él. Devuelve ``None`` si el mensaje no es envíado.
id_id: Pesan yang dikirim oleh saluran tujuan, termasuk ID pesan yang diperbarui dari sana. Mengembalikan ``None`` jika pesan tidak terkirim.
ms_my: Mesej yang dihantar oleh saluran destinasi, termasuk ID mesej dikemaskini dari sana. Pulangan `` Tidak 'jika mesej tidak dihantar.
tr_tr: Hedef kanal tarafından gönderilen mesaj, hedef kanalda güncellenmiş mesaj kimliğini içerir. Eğer mesaj gönderilemezse ``None`` olarak değişir.

source: The status
es_ve: El estado
id_id: Status
ms_my: Statusnya
tr_tr: Durum
