Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/exceptions.po
Languages: az_az, id_id, tr_tr

source: Exceptions
az_az: İstisnalar
id_id: Pengecualian
tr_tr: Kural dışı durumlar

source: Bases: :class:`Exception`
az_az: Təməl: :class:`Exception`
id_id: Dasar: :class:`Pengecualian`

source: A general class to indicate that the exception is from EFB framework.
az_az: EFB framework istisna olunmayan ümumi bir sinifdir.
id_id: Kelas umum untuk menunjukkan bahwa pengecualian tersebut berasal dari framework EFB.
tr_tr: Kurul dışı durumların EFB altyapısından geldiğini belirtmek için kullanılan genel bir sınıf.

source: Bases: :class:`ehforwarderbot.exceptions.EFBException`
az_az: Təməl: :class: `ehforwarderbot.exceptions.EFBException`
id_id: Basis: :class:`ehforwarderbot.exceptions.EFBException`

source: Raised by a slave channel when a chat indicated is not found.
az_az: Bir çatın göstərildiyi zamanı bir ana kanal qaldırıldı.
id_id: Dimunculkan oleh saluran slave ketika chat yang ditunjukkan tidak ditemukan.
tr_tr: Belirtilen bir sohbet bulunamadığında bağımlı kanal yükseltilir.

source: Can be raised by any method that involves a chat or a message.
az_az: Bir çatı və ya mesajı əhatə edən şey hər hansı bir üsulla qaldırıla bilər.
id_id: Bisa dibesarkan dengan metode apapun yang melibatkan obrolan atau pesan.
tr_tr: Sohbet veya mesaj içeren herhangi bir yöntem ile yükseltilebilir.

source: Raised by the coordinator when the message sent delivers to a missing channel.
az_az: Mesaj itirilmiş kanala göndərilmişsə koordinator tərəfindən qaldırılır.
id_id: Dibesarkan oleh koordinator saat pesan terkirim yang disampaikan ke saluran yang hilang.
tr_tr: Mesaj kayıp bir kanala iletildiğinde koordinatör tarafından yükseltilir.

source: Raised by slave channel for any other error occurred when sending a message or a status.
az_az: Mesaj və ya status göndərilərkən hər hansı bir səhv baş verərsə ana kanal tərəfindən qaldırılır.
id_id: Dimunculkan oleh saluran slave untuk setiap kesalahan lain yang terjadi ketika mengirimkan pesan atau status.
tr_tr: Bir mesaj veya bir durum gönderirken meydana gelen herhangi bir hata için bağımlı kanal tarafından yükseltilebilir.

source: Can be raised in :meth:`.EFBChannel.send_message` and :meth:`.EFBChannel.send_status`.
az_az: Daxil oluna bilər :meth:`.EFBChannel.send_message`və :meth:`.EFBChannel.send_status`.
id_id: Dapat dimumculkan pada :meth: .EFBChannel.send_message' dan :meth: .EFBChannel.send_status'.
tr_tr: :meth:`.EFBChannel.send_message` ve :meth:`.EFBChannel.send_status` 'da yükseltilebilir.

source: Bases: :class:`ehforwarderbot.exceptions.EFBMessageError`
az_az: Təməl: :class:`ehforwarderbot.exceptions.EFBMessageError`
id_id: Basis: :class:`ehforwarderbot.exceptions.EFBMessageError`

source: Raised by a slave channel when a message indicated is not found.
az_az: Mesajın göstərmə zamanı yoxdursa ana kanal tərəfindən qaldırılır.
id_id: Dimunculkan oleh saluran slave ketika pesan yang ditunjukkan tidak ditemukan.
tr_tr: Belirtilen bir mesaj bulunamadığında bağımlı kanal tarafından yükseltilir.

source: Can be raised in :meth:`.EFBChannel.send_message` (edited message / target message not found) and in :meth:`.EFBChannel.send_status` (message to delete is not found).
az_az: Daxil ola bilər :meth:`.EFBChannel.send_message` (redaktə olunmuş mesaj / hədəf mesaj tapılmadı) və :meth:`.EFBChannel.send_status` (silinən mesaj tapılmadı).
id_id: Dapat dimunculkan di :meth:`.EFBChannel.send_message` (pesan yang diubah / sasaran pesan tidak ditemukan) dan di :meth:`.EFBChannel.send_status` (pesan yang akan dihapus tidak ditemukan).
tr_tr: :meth:`.EFBChannel.send_message` (düzenlenmiş mesaj / hedef mesaj bulunamadı) ve :meth:`.EFBChannel.send_status` (silinecek mesaj bulunamadığında) içerisinde yükseltilebilir.

source: Raised by a slave channel when the indicated message type is not supported.
az_az: Mesaj növü dəstəklənmədiyində ana kanal tərəfindən qaldırıla bilər.
id_id: Dimunculkan oleh saluran slave ketika jenis pesan yang ditunjukkan tidak didukung.
tr_tr: Belirtilen mesaj türü desteklenmediğinde bağımlı kanal tarafından yükseltilir.

source: Can be raised in :meth:`.EFBChannel.send_message`.
az_az: Daxil ola bilər :meth:`.EFBChannel.send_message`.
id_id: Dapat dimunculkan di :meth:`.EFBChannel.send_message`.
tr_tr: :meth:`.EFBChannel.send_message` 'da yükseltilebilir.

source: Raised by slave channels when a chat operation is not supported. E.g.: cannot edit message, cannot delete message.
az_az: Çat əməliyyatı dəstəklənmədiyində ana kanal tərəfindən qaldırılır. Məs. mesaj redaktə oluna bilmir, mesaj silinə bilmir.
id_id: Dimunculkan oleh saluran slave ketika operasi chat tidak didukung. Misalnya: tidak dapat mengedit pesan, tidak dapat menghapus pesan.
tr_tr: Bir sohbet işlemi desteklenmediğinde bağımlı kanallar tarafından yükseltilir. Örnek olarak: mesaj düzenleyemezsiniz, mesaj silemezsiniz.
