Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/message.po
Languages: es_ve, id_id

source: A message.
es_ve: Un mensaje.
id_id: Sebuah pesan.

source: Optional[:obj:`.EFBMsgAttribute`] -- Attributes used for a specific message type. Only specific message type requires this attribute. Defaulted to ``None``.
es_ve: Optional[:obj:`.EFBMsgAttribute`] -- Atributos usados para un tipo de mensaje específico. Solo ciertos tipos de mensajes requieren este atributo. Su valor por defecto es ``None``.
id_id: Pilihan [:obj:'. EFBMsgAttribute`] -- perlengkapan yang digunakan untuk jenis pesan tertentu. Hanya jenis pesan tertentu membutuhkan perlengkapan ini. Gagal untuk ``Sama sekali tidak``.

source: Link: :obj:`.EFBMsgLinkAttribute`
id_id: Tautan: :obj:`. EFBMsgLinkAttribute'

source: Location: :obj:`.EFBMsgLocationAttribute`
id_id: Lokasi: :obj:'. EFBMsgLocationAttribute'

source: Status: Typing/Sending files/etc.: :obj:`.EFBMsgStatusAttribute`
es_ve: Status: Escribir /enviar archivos/etc.: :obj:`.EFBMsgStatusAttribute`
id_id: Status: Mengetik/mengirim beberapa berkas/etc.: :obj:`.EFBMsgStatusAttribute`

source: Do NOT use object of the abstract class :class:`.EFBMsgAttribute` for ``attributes``, but object of specific class instead.
es_ve: NO uses el objeto de la clase abstracta :class:`.EFBMsgAttribute` para ``attributes``. En su lugar utiliza los objetos de las clases específicas.
id_id: JANGAN gunakan objek kelas abstrak :class:`.EFBMsgAttribute` untuk` `perlengkapan``, tapi objek dari kelas tertentu.

source: :obj:`.EFBChat` -- Author of this message.
es_ve: :obj:`.EFBChat` -- Autor del mensaje.
id_id: :obj:'. EFBChat'--penulis pesan ini.

source: :obj:`.EFBChat` -- Sender of the message.
es_ve: :obj:`.EFBChat` -- Remitente del mensaje.
id_id: :obj:`.EFBChat` -- Pengirim pesan.

source: Optional[:obj:`EFBMsgCommands`] -- Commands attached to the message
es_ve: Optional[:obj:`EFBMsgCommands`] -- Comandos adjuntados al mensaje
id_id: Opsional [: obj: `EFBMsgCommands`] - Perintah yang menyertai pesan

source: :obj:`.EFBChannel` -- The channel that the message is to be delivered to
es_ve: :obj:`.EFBChannel` -- El canal al cual se entregará el mensaje
id_id: :obj:'. EFBChannel'--saluran yang pesan dikirim ke

source: *bool* -- Flag this up if the message is edited.
es_ve: *bool* -- Habilita esta bandera si el mensaje fue editado.
id_id: *Bool*--bendera hal ini jika pesan diedit.

source: *IO[bytes]* -- File object to multimedia file, type "ra". ``None`` if N/A. recommended to use ``NamedTemporaryFile`` object, the file can be deleted when closed, if not used otherwise. All file object must be rewind back to 0 (``file.seek(0)``) before sending.
es_ve: *IO[bytes]* -- Archivo objeto a archivo multimedia, tipo "ra". ``None`` si es N/A. Es recomendado usar un objeto ``NamedTemporaryFile``, el cual al ser cerrado sea eliminado sino será usado nuevamente. Todos los archivos objetos deben ser devueltos a 0 (``file.seek(0)``) antes de enviar.
id_id: *IO[bytes]* -- Berkas objek untuk multimedia berkas, ketik "ra". ``Tidak ada`` jika N/A. dianjurkan untuk menggunakan `NamedTemporaryFile` objek, berkas dapat dihapus ketika ditutup, jika tidak digunakan jika tidak. Semua objek berkas harus mundur kembali ke 0 (``file.seek(0)``) sebelum pengiriman.

source: *str* -- File name of the multimedia file. ``None`` if N/A
es_ve: *str* -- Nombre del archivo multimedia. ``None`` si es N/A
id_id: *str* -- nama berkas dari berkas multimedia. ``Tidak ada`` jika N/A

source: *bool* -- Mark as true if this message is a system message.
es_ve: *bool* -- Habilítala como true si el mensaje es un mensaje de sistema.
id_id: *bool* -- Tandai benar jika pesan ini adalah pesan sistem.

source: *str* -- MIME type of the file. ``None`` if N/A
es_ve: *str* -- tipo MIME del archivo. ``None`` si es N/A
id_id: *str* -- tipe MIME dari berkas. ``Tidak ada`` jika N/A

source: *str* -- Local path of multimedia file. ``None`` if N/A
es_ve: *str* -- ruta local del archivo multimedia. ``None`` si es N/A
id_id: *str* -- jalan lokal dari berkas multimedia. ``Tidak ada`` jika N/A

source: Optional[:obj:`EFBMsgSubstitutions`] -- Substitutions of messages, usually used when the some parts of the text of the message refers to another user or chat.
es_ve: Optional[:obj:`EFBMsgSubstitutions`] -- Substitución de mensajes, se usa usualmente cuando una parte del texto se refiere a otro usuario o chat.
id_id: Opsional[:obj:`EFBMsgSubstitutions`] -- Substitusi pesan, biasanya digunakan ketika beberapa bagian dari pesan teks mengacu ke pengguna lain atau obrolan.

source: Optional[:obj:`EFBMsg`] -- Target message (usually for messages that "replies to" another message).
es_ve: Optional[:obj:`EFBMsg`] -- Mensaje de destino (usado normalmente por mensaje que "responden a" otro mensaje).
id_id: Opsional[:obj:`EFBMsg`] -- Sasaran pesan (biasanya untuk pesan-pesan yang "balasan untuk" pesan lain).

source: This message may be a "minimum message", with only required fields:
es_ve: Este mensaje puede ser un "minimum message", el cual solo contiene los campos requeridos:
id_id: Pesan ini mungkin "minimal pesan", dengan hanya bidang yang diperlukan:

source: *str* -- text of the message
es_ve: *str* -- Texto del mensaje
id_id: * str *--teks pesan

source: :obj:`.MsgType` -- Type of message
es_ve: :obj:`.MsgType` -- Tipo del mensaje
id_id: :obj:'. MsgType'--jenis pesan

source: *str* -- Unique ID of message. Usually stores the message ID from slave channel. This ID must be unique among all chats in the same channel.
es_ve: *str* -- ID único del mensaje. Es usado usualmente para guardar los ID de los mensajes provenientes del canal esclavo. Este ID debe ser único entre todos los chats dentro del mismo canal.
id_id: *str* -- ID unik dari pesan. Biasanya menyimpan pesan ID dari saluran budak. ID ini harus unik di antara semua obrolan di saluran yang sama.

source: Some channels may not support message editing. Some channels may issue a new uid for edited message.
es_ve: Algunos canales pueden no ser compatibles con la edición de los mensajes. Otros podrían crear un nuevo uid para los mensajes editados.
id_id: Beberapa saluran mungkin tidak mendukung pesan editing. Beberapa saluran mungkin dapat persoalan uid baru untuk menerbitkan pesan.

source: *Dict[str, Any]* -- A series of vendor specific attributes attached. This can be used by any other channels or middlewares that is compatible with such information. Note that no guarantee is provided for information in this section.
es_ve: *Dict[str, Any]* -- Atributos adjuntos específicos de proveedor. Pueden ser usados por cualquier otro canal o "middlewares" que sean compatibles con dicha información. Notar que no se proporciona ninguna garantía de información en esta sección.
id_id: *Dict[str, Apapun]* -- serangkaian penjual atribut tertentu yang terpasang. Ini dapat digunakan oleh setiap saluran lain atau middlewares yang kompatibel dengan informasi tersebut. Perhatikan bahwa tidak ada jaminan yang diberikan dalam bagian ini.

source: Verify the validity of message.
es_ve: Verificar la validez del mensaje.
id_id: Verifikasi keabsahan pesan.

source: Bases: :class:`abc.ABC`
id_id: Basis: :kelas: `abc.ABC`

source: Abstract class of a message attribute.
id_id: Kelas abstrak dari sebuah atribut pesan.

source: Bases: :class:`object`
id_id: Basis: :kelas: `objek`

source: EFB message command.
id_id: EFB pesan perintah.

source: *str* -- Human-friendly name of the command.
es_ve: *str* -- Un nombre legible para el canal.
id_id: * str * - Nama perintah manusia yang bersahabat.

source: *str* -- Callable name of the command.
es_ve: *str* -- Nombre de invocación del comando.
id_id: * str * - Callable nama perintah.

source: *List[Any]* -- Arguments passed to the function.
es_ve: *List[Any]* -- Argumentos pasados a la función.
id_id: * Daftar [Any] * - Argumen diteruskan ke fungsi.

source: *Dict[str, Any]* -- Keyword arguments passed to the function.
es_ve: *Dict[str, Any]* -- parámetros de la función pasados como palabras claves.
id_id: * Dict [str, Any] * - Kata kunci argumen dilewatkan ke fungsi.

source: Parameters
es_ve: Parámetros
id_id: Parameter

source: Human-friendly name of the command.
es_ve: Nombre amigable del comando.
id_id: Nama perintah manusia yang bersahabat.

source: Callable name of the command.
es_ve: Nombre de invocación del comando.
id_id: Callable nama perintah.

source: Arguments passed to the function. Defaulted to empty list;
es_ve: Argumentos pasados a la función. Por defecto es una lista vacía;
id_id: Argumen diteruskan ke fungsi. Default ke daftar kosong;

source: Keyword arguments passed to the function. Defaulted to empty dict.
es_ve: Argumentos de la función pasados como palabras claves. Por defecto es un diccionario vacío.
id_id: Argumen kata kunci diteruskan ke fungsi. Default untuk mengosongkan dict.

source: EFB message commands. Message commands allow user to take action to a specific message, including vote, add friends, etc.
es_ve: Comandos de mensajes EFB. Los comandos de mensaje permiten al usuario elegir ciertas acciones sobre un mensaje específico. Agregar amigos, Incluir votos, etc.
id_id: Perintah pesan EFB. Perintah pesan mengizinkan pengguna untuk melakukan tindakan terhadap pesan tertentu, termasuk memilih, menambahkan teman, dll.

source: list of :obj:`EFBMsgCommand` -- Commands for the message.
es_ve: list of :obj:`EFBMsgCommand` -- Comandos de mensaje.
id_id: daftar :obj:`EFBMsgCommand` -- Perintah untuk pesan.

source: Commands for the message.
es_ve: Comandos de mensaje.
id_id: Perintah untuk pesan.

source: Bases: :class:`ehforwarderbot.message.EFBMsgAttribute`
id_id: Basis:: kelas: `ehforwarderbot.message.EFBMsgAttribute`

source: EFB link message attribute.
es_ve: Atributo de mensaje de enlace EFB.
id_id: Atribut pesan link EFB.

source: *str* -- Title of the link.
es_ve: *str* -- Título del enlace.
id_id: * str* -- Judul link.

source: *str, optional* -- Description of the link.
es_ve: *str, optional* -- Descripción del link.
id_id: *str, pilih* -- Deskripsi dari tautan.

source: *str, optional* -- Image/thumbnail URL of the link.
es_ve: *str, optional* -- URL de Imágen/miniatura del enlace.
id_id: *str, pilih* -- URL gambar/thumbnail dari tautan.

source: *str* -- URL of the link.
es_ve: *str* -- URL del enlace.
id_id: *str* -- URL tautan.

source: Title of the link.
es_ve: Título del enlace.
id_id: Judul dari tautan.

source: Description of the link.
es_ve: Descripción del enlace.
id_id: Deskripsi dari tautan.

source: Image/thumbnail URL of the link.
es_ve: URL de imágen/miniatura del enlace.
id_id: URL gambar/thumbnail dari tautan.

source: URL of the link.
es_ve: URL del enlace.
id_id: URL dari tautan.

source: EFB location message attribute.
es_ve: Atributo de mensaje de localización EFB.
id_id: Atribut pesan lokasi EFB.

source: *float* -- Latitude of the location.
es_ve: *float* -- Latitud de la ubicación en español.
id_id: * float* -- Lintang lokasi.

source: *float* -- Longitude of the location.
es_ve: *float* -- Longitud de la localización.
id_id: *pelampung* -- Bujur dari lokasi.

source: Latitude of the location.
es_ve: Latitud de la localización.
id_id: Lintang lokasi.

source: Longitude of the location.
es_ve: Longitud de la localización.
id_id: Bujur lokasi.

source: EFB Message status attribute. Message with type ``Status`` notifies the other end to update a chat-specific status, such as typing, send files, etc.
es_ve: Atributo de estado del mensaje EFB. Mensajes con el tipo ``Status`` notifican a la parte receptora que actualice el estado de un chat-específico, tal como escribiendo, enviando archivos, entre otros.
id_id: Perlengkapan status pesan EFB Pesan dengan jenis ``Status`` memberitahukan pihak lain untuk memperbarui status khusus obrolan, seperti mengetik, mengirim berkas, dll.

source: Type of status, possible values are defined in the ``EFBMsgStatusAttribute``.
es_ve: Los tipos de valores posibles en los tipos de estados están definidos en ``EFBMsgStatusAttribute``.
id_id: Jenis status, nilai yang mungkin ditentukan dalam ``EFBMsgStatusAttribute``.

source: *Optional[int]* -- Number of milliseconds for this status to expire. Default to 5 seconds.
es_ve: *Optional[int]* -- Número de milisegundos para que expire el estado. El valor por defecto es de 5 segundos.
id_id: *Opsional[int]* -- Jumlah milidetik untuk status ini akan kadaluarsa. Standar ke 5 detik.

source: List of status types supported
es_ve: Lista del tipo de estados soportados
id_id: Daftar jenis status yang didukung

source: Bases: :class:`enum.Enum`
id_id: Basis: :kelas:`enum.Enum`

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of typing.
es_ve: Usado en :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, representa el estado "escribiendo".
id_id: Digunakan di :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, mewakili status pengetikan.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading file.
es_ve: Usado en :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, representa el estado de archivo siendo cargado.
id_id: Digunakan di :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, mewakili status unggahan berkas.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading image.
es_ve: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, representa el estado de la imágen cargandose.
id_id: Digunakan di :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, mewakili status unggahan gambar.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading audio.
es_ve: Usado en :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, representa el estado del archivo de audio cargandose.
id_id: Digunakan di :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, mewakili status mengunggah audio.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading video.
es_ve: Usado en :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, representa el estado del video cargandose.
id_id: Digunakan di :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, mewakili status mengunggah video.

source: Type of status.
es_ve: El tipo de estado.
id_id: Jenis dari status.

source: Number of milliseconds for this status to expire. Default to 5 seconds.
es_ve: Número de milisegundos para que el estado expire. El valor por defecto es de 5 segundos.
id_id: Jumlah milidetik untuk status ini akan kadaluarsa. Default ke 5 detik.

source: Bases: :class:`dict`
id_id: Basis:: kelas: `dict`

source: EFB message substitutions.
es_ve: Substituciones de mensajes EFB.
id_id: Substitusi pesan EFB.

source: This is for the case when user "@-referred" a list of users in the message. Substitutions here is a dict of correspondence between the string used to refer to the user in the message and a user object.
id_id: Ini adalah kasus ketika pengguna "@-disebut" daftar pengguna di pesan. Substitusi berikut adalah dict korespondensi antara string yang digunakan untuk merujuk kepada pengguna dalam pesan dan objek pengguna.

source: Dictionary of text substitutions targeting to a user or member.
es_ve: Diccionario o substitución de texto dirigido a un usuario o miembro.
id_id: Kamus substitusi teks yang ditargetkan ke pengguna atau member.

source: The key of the dictionary is a tuple of two :obj:`int`\ s, where first of it is the starting position in the string, and the second is the ending position defined similar to Python's substring. A tuple of ``(3, 15)`` corresponds to ``msg.text[3:15]``. The value of the tuple ``(a, b)`` must lie within ``a ∈ [0, l)``, ``b ∈ (a, l]``, where ``l`` is the length of the message text.
id_id: Kunci dari kamus adalah sebuah tuple dari dua :obj:`int`\ s, di mana lebih dari itu adalah posisi awal dalam string, dan yang kedua adalah posisi berakhir didefinisikan mirip dengan Python substring. Sebuah tuple ``(3, 15)`` sesuai dengan ``msg.teks[3:15]``. Nilai dari tuple ``(a, b)`` harus berbaring dalam ``a ∈ [0, l)``, ``b ∈ (a, l]``, di mana ``l`` adalah panjang dari pesan teks.

source: Value of the dict may be any user of the chat, or a member of a group. Notice that the :obj:`EFBChat` object here must NOT be a group.
es_ve: El valor del diccionario puede ser cualquier usuario dentro del chat o un miembro de grupo. Nota que el objeto :obj:`EFBChat` usado NO debe ser un grupo.
id_id: Nilai dict bisa jadi pengguna chat, atau anggota grup. Perhatikan bahwa: obj: `EFBChat` objek disini TIDAK boleh menjadi grup.

source: Type:
es_ve: Tipo:
id_id: Jenis:

source: Examples
es_ve: Ejemplos
id_id: Contoh

source: Prelude: Defining related chats
id_id: Pendahuluan: Mendefinisikan obrolan terkait

source: Initialization and marking chats
es_ve: Inicialización y marcado de chats
id_id: Inisialisasi dan menandai obrolan

source: Marking message references (targeted message)
es_ve: Marcado de referencias de mensajes (mensajes destino)
id_id: Menandai referensi pesan (pesan ditargetkan)

source: Edit a previously sent message
es_ve: Edita un mensaje enviado previamente
id_id: Ubah pesan yang sebelumnya terkirim

source: Type-specific Information
es_ve: Información específica del tipo
id_id: Informasi berjenis khusus

source: Text message
es_ve: Mensaje de texto
id_id: Pesan teks

source: Media message
es_ve: Mensaje multimedia
id_id: Pesan media

source: Information related to media processing is described in :doc:`/guide/media_processing`.
es_ve: Información relacionada al procesamiento multimedia descrito en :doc:`/guide/media_processing`.
id_id: Informasi yang berkaitan dengan pengolahan media dijelaskan di :doc:`/guide/media_processing`.

source: The example below is for image (picture) messages. Audio, file, video, sticker works in the same way.
es_ve: El ejemplo siguiente es para mensajes de imágenes (fotos). Audio, archivos, video, y calcomanías (stickers) trabajan de la misma manera.
id_id: Contoh di bawah ini adalah untuk gambar (foto) pesan. Audio, berkas, video, stiker bekerja dengan cara yang sama.

source: In non-text messages, the ``text`` attribute is optional.
es_ve: En mensajes que no son de texto el atributo ``text`` es opcional.
id_id: Dalam pesan non-teks, perlengkapan `` teks`` adalah pilihan.

source: Location message
es_ve: Localización del mensaje
id_id: Lokasi pesan

source: Link message
es_ve: Enlace del mensaje
id_id: Tautan pesan

source: Unsupported message
es_ve: Mensaje no soportado
id_id: Pesan tidak didukung

source: ``text`` attribute is required for this type of message.
es_ve: Se requiere el atributo ``text`` para este tipo de mensajes.
id_id: Perlengkapan ``teks`` diperlukan untuk jenis pesan ini.

source: Additional information
es_ve: Información adicional
id_id: Informasi tambahan

source: Substitution
es_ve: Substitución
id_id: Pengganti

source: Commands
es_ve: Comandos
id_id: Perintah

source: Status
es_ve: Estado
