Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/middleware.po
Languages: es_ve

source: Middleware class.
es_ve: Clase Middleware.

source: *str* -- Human-readable name of the middleware.
es_ve: *str* -- Nombre para el middleware.

source: *str* -- The instance ID if available.
es_ve: *str* -- La instancia del ID, si está disponible.

source: Initialize the middleware. Inherited initializer must call the "super init" method at the beginning.
es_ve: Inicialización del middleware. El inicializador heredado debe llamar al comienzo el método "super init".

source: Parameters
es_ve: Parámetros

source: Instance ID of the channel.
es_ve: ID de la instancia del canal.

source: Process a message with middleware
es_ve: Procesa un mensaje con el middleware

source: Message object to process
es_ve: Objeto mensaje a procesar

source: Returns
es_ve: Resultados

source: Processed message or None if discarded.
es_ve: Mensaje procesado o None si es descartado.

source: Return type
es_ve: Tipo de dato devuelto

source: Process a status update with middleware
es_ve: Procesa una actualización del estado con el middleware

source: Processed status or None if discarded.
es_ve: Estado procesado o None si es descartado.

source: About Middleware ID
es_ve: Acerca del ID del middleware

source: With the introduction of instance IDs, it is required to use the ``self.middleware_id`` or equivalent instead of any hard-coded ID or constants while referring to the middleware (e.g. while retrieving the path to the configuration files, etc).
es_ve: Con la introducción de los ID de las instancias, es necesario utilizar ``self.middleware_id`` o un equivalente en vez de escribir manualmente el código del ID o utilizar constantes al momento de referirnos al middleware ( Ejemplo: al obtener la ruta del archivo de configuración, etc).
