Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/status.po
Languages: es_ve, tr_tr

source: Status
es_ve: Estado
tr_tr: Durum

source: Abstract class of a status
es_ve: Clase abstracta del estado
tr_tr: Bir durumun özet dersi

source: :obj:`.EFBChannel` -- The channel that this status is sent to, usually the master channel.
es_ve: :obj:`.EFBChannel` -- El canal al que se envía este estado, normalmente el canal maestro.
tr_tr: :obj:`.EFBChannel` -- Bu durumdaki kanal genellikle ana kanala gönderilir.

source: Inform the master channel on updates of slave chats.
es_ve: Informa sobre actualizaciones de los canales esclavos al canal maestro.
tr_tr: Bağımlı kanal sohbet güncellemelerini ana kanala bildirin.

source: :obj:`.EFBChannel` -- Slave channel that issues the update
es_ve: :obj:`.EFBChannel` -- Canal esclavo que emite la actualización
tr_tr: :obj:`.EFBChannel` -- Güncelleştirme sorunu olan bağımlı kanal

source: *Optional[Tuple[str]]* -- Unique ID of new chats
es_ve: *Optional[Tuple[str]]* -- ID único de los nuevos chats
tr_tr: *Optional[Tuple[str]]* -- Yeni sohbetlerin benzersiz kimliği

source: *Optional[Tuple[str]]* -- Unique ID of removed chats
es_ve: *Optional[Tuple[str]]* -- ID único de los chats removidos
tr_tr: *Optional[Tuple[str]]* -- Kaldırılan sohbetlerin benzersiz kimliği

source: *Optional[Tuple[str]]* -- Unique ID of modified chats
es_ve: *Optional[Tuple[str]]* -- ID único de los chats modificados
tr_tr: *Optional[Tuple[str]]* -- Değiştirilmiş sohbetlerin benzersiz kimliği

source: Parameters
es_ve: Parámetros
tr_tr: Parametreler

source: Slave channel that issues the update
es_ve: Canal esclavo que emite la actualización
tr_tr: Güncelleştirme sorunu olan bağımlı kanal

source: Unique ID of new chats
es_ve: ID único de los nuevos chats
tr_tr: Yeni sohbetlerin benzersiz kimlik no

source: Unique ID of removed chats
es_ve: ID único de los chat removidos
tr_tr: Kaldırılmış olan sohbetlerin benzersiz kimliği

source: Unique ID of modified chats
es_ve: ID único de los chats modificados
tr_tr: Değiştirilmiş olan sohbetlerin benzersiz kimliği

source: Inform the master channel on updates of members in a slave chat.
es_ve: Informa sobre actualizaciones de miembros provenientes del canal esclavo al canal maestro.
tr_tr: Bağımlı sohbet üyelerinin güncellemelerini ana kanala bildirin.

source: *str* -- Unique ID of the chat.
es_ve: *str* -- ID único del chat.
tr_tr: *str* -- sohbetin benzersiz kimliği.

source: *Optional[Tuple[str]]* -- Unique ID of new members
es_ve: *Optional[Tuple[str]]* -- ID único de nuevos miembros
tr_tr: *Optional[Tuple[str]]* -- Yeni üyelerin benzersiz kimliği

source: *Optional[Tuple[str]]* -- Unique ID of removed members
es_ve: *Optional[Tuple[str]]* -- ID único de miembros removidos
tr_tr: *Optional[Tuple[str]]* -- Kaldırılmış üyelerin benzersiz kimliği

source: *Optional[Tuple[str]]* -- Unique ID of modified members
es_ve: *Optional[Tuple[str]]* -- ID único de miembros modificados
tr_tr: *Optional[Tuple[str]]* -- Değiştirilmiş üyelerin benzersiz kimliği

source: Unique ID of the chat.
es_ve: ID único del chat.
tr_tr: Sohbetin benzersiz kimliği.

source: Unique ID of new members
es_ve: ID único de nuevos miembros
tr_tr: Yeni üyelerin benzersiz kimliği

source: Unique ID of removed members
es_ve: ID único de los miembros removidos
tr_tr: Kaldırılan üyelerin benzersiz kimliği

source: Unique ID of modified members
es_ve: ID único de los miembros modificados
tr_tr: Değiştirilen üyelerin benzersiz kimliği

source: Inform a channel to remove a certain message.
es_ve: Le indica al canal que elimine un mensaje específico.
tr_tr: Belirlenmiş bir mesajı kaldırmak için kanalı bilgilendir.

source: This is usually known as "delete from everyone", "delete from recipient", "recall a message", or "revoke a message" as well, depends on the IM.
es_ve: Esto se conoce usualmente como " elimina en todos","elimina del destinatario", "recordar u mensaje", o "invalida un mensaje", depende del IM.
tr_tr: Bu genellikle "herkesten sil", "alıcıdan sil", "mesajı geri çek" veya "mesajı iptal et" olarak bilinir, hem de IM'ye bağlıdır.

source: Some channels may not support removal of messages, and raises a :obj:`.exceptions.EFBOperationNotSupported` exception.
es_ve: Algunos canales pueden que no soporten la eliminación de mensajes, y llamen a una excepción :obj:`.exceptions.EFBOperationNotSupported` exception.
tr_tr: Bazı kanallar, mesajların kaldırılmasını desteklemeyebilir ve bir :obj:`.exceptions.EFBOperationNotSupported` istisnası yüksektir.

source: :obj:`.EFBChannel` -- Channel issued the status
es_ve: :obj:`.EFBChannel` -- El canal emitió el estado
tr_tr: :obj:`.EFBChannel` --Kanal durumu yayınlandı

source: :obj:`.EFBChannel` -- Channel the status is issued to
es_ve: :obj:`.EFBChannel` -- El canal al cual se emite el estado
tr_tr: :obj:`.EFBChannel` -- Durumun yayınlandığı kanal

source: :obj:`.EFBMsg` -- Message to remove. This may not be a complete :obj:`.EFBMsg` object.
es_ve: :obj:`.EFBMsg` -- Mensaje a remover. Esto podría no ser un objeto completo :obj:`.EFBMsg`.
tr_tr: :obj:`.EFBMsg` -- Kaldırılacak mesaj. Bu tam olmayabilir. :obj:`.EFBMsg` object.

source: Create a message removal status
es_ve: Crear un mensaje de remoción de estado
tr_tr: Mesaj kaldırma durumu oluşturma

source: Try to provided as much as you can, if not, provide a minimum information in the channel:
es_ve: Trata de proporcionar lo más que puedas, si no, proporciona un mínimo de información en el canal:
tr_tr: Mümkün olduğu kadar temin etmeye çalışın, eğer olmazsa, kanal içinde asgari bilgi temin edin:

source: Slave channel ID and chat ID (:attr:`message.chat.channel_id <.EFBChat.channel_id>` and :attr:`message.chat.chat_uid <.EFBChat.chat_uid>`)
es_ve: ID del canal esclavo y ID del chat (:attr:`message.chat.channel_id <.EFBChat.channel_id>` y :attr:`message.chat.chat_uid <.EFBChat.chat_uid>`)
tr_tr: Bağımlı kanal kimliği ve sohbet kimliği (:attr:`message.chat.channel_id <.EFBChat.channel_id>` ve :attr:`message.chat.chat_uid <.EFBChat.chat_uid>`)

source: Message unique ID from the slave channel (:attr:`message.uid <.EFBMsg.uid>`)
es_ve: ID único de mensaje proveniente del canal esclavo (:attr:`message.uid <.EFBMsg.uid>`)
tr_tr: Bağımlı kanaldan benzersiz kimlik mesajı (:attr:`message.uid <.EFBMsg.uid>`)

source: Channel issued the status
es_ve: El canal emitió el estado
tr_tr: Kanal durumu yayınlandı

source: Channel the status is issued to
es_ve: El canal al cual se emite el estado
tr_tr: Durumun yayınlandığı kanal

source: Message to remove.
es_ve: Mensaje a remover.
tr_tr: Kaldırılacak mesaj.
