Repository: ehForwarderBot/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/utils.po
Languages: es_ve, id_id, tr_tr

source: Utilities
es_ve: Utilidades
id_id: Utilitas
tr_tr: Araçlar

source: Decorator for slave channel's "additional features" interface.
es_ve: Decoradores para la interfaz de "opciones adicionales" en los canales esclavos.
id_id: Dekorator untuk antarmuka "fitur tambahan" slave channel.
tr_tr: Bağımlı kanalın "ek özellikler" arayüzü için dekoratör.

source: Parameters
es_ve: Parámetros
id_id: Parameter
tr_tr: Parametreler

source: A human readable name for the function.
es_ve: Nombre legible y amigable para la función.
id_id: Sebuah nama yang dapat dibaca manusia untuk fungsi.
tr_tr: Fonksiyonun insan tarafından okunabilir adı.

source: A short description and usage of it. Use ``{function_name}`` in place of the function name in the description.
es_ve: Una descripción corta de él y de su uso. Usa ``{function_name}`` en el lugar del nombre de la función dentro de la descripción.
id_id: Sebuah deskripsi singkat dan kegunaannya. Menggunakan ``{function_name}`` di tempat nama fungsi dalam deskripsi.
tr_tr: Kısa açıklama ve kullanımı. Açıklamada fonksiyon adı yerine ``{function_name}`` kullanın.

source: Returns
es_ve: Resultados
id_id: Kembali
tr_tr: Geri dönüşler

source: The decorated method.
es_ve: El método decorado.
id_id: Metode yang dihias.
tr_tr: Dekore edilmiş yöntem.

source: Get the base data path for EFB. This can be defined by the environment variable ``EFB_DATA_PATH``.
es_ve: Obtén la ruta base de los datos EFB. Esto puede ser definida en la variable de entorno ``EFB_DATA_PATH``.
id_id: Dapatkan jalur data dasar untuk EFB. Hal ini dapat didefinisikan oleh variabel lingkungan `` EFB_DATA_PATH``.
tr_tr: EFB'nin temel veri yolunu edinin. Bu, çevre değişkeni ``EFB_DATA_PATH`` ile tanımlanabilir.

source: If ``EFB_DATA_PATH`` is not defined, this gives ``~/.ehforwarderbot``.
es_ve: Si ``EFB_DATA_PATH`` no ha sido definida, la ruta por defecto es ``~/.ehforwarderbot``.
id_id: Jika `` EFB_DATA_PATH`` tidak didefinisikan, ini memberikan `` ~ /.ehforwarderbot``.
tr_tr: Eğer `` EFB_DATA_PATH`` tanımlı değilse, varsayılan yol `` ~ /.ehforwarderbot`` dir.

source: This method creates the queried path if not existing.
es_ve: Este método crea la ruta consultada si ésta no existe.
id_id: Metode ini menimbulkan jalur tanya jika tidak ada.
tr_tr: Bu yöntem mevcut değilse sorgulanan yolu oluşturur.

source: The base path.
es_ve: La ruta base.
id_id: Jalur dasar.
tr_tr: Temel yol.

source: Return type
es_ve: Tipo de dato devuelto

source: Get path for configuration file. Defaulted to ``~/.ehforwarderbot/profiles/profile_name/channel_id/config.yaml``.
es_ve: Obtén la ruta del archivo de configuración. El valor predeterminado es ``~/.ehforwarderbot/profiles/profile_name/channel_id/config.yaml``.
id_id: Dapatkan path untuk file konfigurasi. Default ke `` ~ /.ehforwarderbot / profiles / profile_name / channel_id / config.yaml``.
tr_tr: Yapılandırma dosyası için yol edinin. Öntanımlı olarak``~/.ehforwarderbot/profiles/profile_name/channel_id/config.yaml``.

source: This method creates the queried path if not existing. The config file will not be created, however.
es_ve: Este método crea la ruta consultada si ésta no existe. pero el archivo de configuración no será creado.
id_id: Metode ini menimbulkan jalur tanya jika tidak ada. File konfigurasi tidak akan dibuat, akan tetapi.
tr_tr: Bu yöntem mevcut değilse sorgulanan yolu oluşturur. Fakat yapılandırma dosyası oluşturmaz.

source: Module ID.
es_ve: ID del módulo.
id_id: ID Modul.
tr_tr: Modül no.

source: Extension name of the config file. Defaulted to ``"yaml"``.
es_ve: Nombre de la extensión del archivo de configuración. Su valor predeterminado es ``"yaml"``.
id_id: Nama ekstensi dari file konfigurasi Default ke `` "yaml" ``.
tr_tr: Yapılandırma dosyası uzantısının adı. Öntanımlı olarak ``"yaml"``.

source: The path to the configuration file.
es_ve: La ruta al archivo de configuración.
id_id: Jalan menuju file konfigurasi.
tr_tr: Yapılandırma dosyasının yolu.

source: Get the path to custom channels
es_ve: Obtén la ruta de los canales personalizados
id_id: Dapatkan jalur ke saluran khusus
tr_tr: Özel kanallara giden yolu al

source: The path.
es_ve: La ruta de acceso.

source: Get the path for permanent storage of a module.
es_ve: Obtén la ruta para el módulo de almacenamiento permanente.

source: Module ID
es_ve: ID del módulo
id_id: ID Modul
tr_tr: Modül No

source: Locate module by module ID
es_ve: Localizar el módulo utilizando el ID del módulo
id_id: Mencari modul dengan ID modul
tr_tr: Modül no ile modülü bulun

source: Type of module, one of ``'master'``, ``'slave'`` and ``'middleware'``
es_ve: Tipo de módulo, uno de ``'maestro'``, ``'esclavo'`` y ``'middleware'``
id_id: Jenis modul, salah satu `` 'master'```, ``' slave'`` dan `` 'middleware'``
tr_tr: ``'master'``, ``'slave'`` ve ``'middleware'`` modül tiplerinden biridir
